Repository: jarabt/Hbook
Catalog: 08_basic-configuration.po
Languages: cs_cz

source: In practice, there is a problem, since the CMOS clock is nothing more than a counter and contains no information regarding the time zone. There is a choice to make regarding its interpretation: either the system considers it runs in universal time (UTC, formerly GMT), or in local time. This choice could be a simple shift, but things are actually more complicated: as a result of daylight saving time, this offset is not constant. The result is that the system has no way to determine whether the offset is correct, especially around periods of time change. Since it is always possible to reconstruct local time from universal time and the timezone information, we strongly recommend using the CMOS clock in universal time.
cs_cz: V praxi je zde problém, protože CMOS hodiny nejsou nic jiného, než počítadlo a neobsahují žádné informace ohledně časové zóny. Je zde volba, která se může využít ohledně jejich interpretace: ať už systém zjistí, že běží na univerzálním čase (UTC, dříve GMT) nebo na místním čase. Tato volba může být pouhé přehození, ale věci jsou ve skutečnosti složitější: důsledkem letního času tato kompenzace není konstantní. Výsledek je, že systém nemá žádnou šanci, jak určit, zda je kompenzace správná, zvláště kolem období, kdy dochází ke změné času. Protože je vždy možné obnovit místní čas z univerzálního času a informace o časové zóně, hodně doporučujeme použití CMOS hodin v univerzálním čase.

source: Unfortunately, Windows systems in their default configuration ignore this recommendation; they keep the CMOS clock on local time, applying time changes when booting the computer by trying to guess during time changes if the change has already been applied or not. This works relatively well, as long as the system has only Windows running on it. But when a computer has several systems (whether it be a “dual-boot” configuration or running other systems via virtual machine), chaos ensues, with no means to determine if the time is correct. If you absolutely must retain Windows on a computer, you should either configure it to keep the CMOS clock as UTC (setting the registry key <literal>HKLM\SYSTEM\CurrentControlSet\Control\TimeZoneInformation\RealTimeIsUniversal</literal> to “1” as a DWORD), or use <command>hwclock --localtime --set</command> on the Debian system to set the hardware clock and mark it as tracking the local time (and make sure to manually check your clock in spring and autumn).
cs_cz: Bohužel, systém Windows ve svém výchozím nastavení ignoruje toto doporučení; udžeje CMOS hodiny na místním čase a uplatňuje změny času při bootování počítače tím, že se snaží během změn času uhodnout, zda již změna byla uplatněna, či ne. Toto funguje relativně dobře, dokud na systému běží pouze Windows. Ale pokud má počítač více různých systémů (ať už to je nastavení “dual-boot” nebo běh jiného sytému prostřednictvím virtuálního zařízení), nastává chaos, s žádnými prostředky jak zjistit, zda je čas správný. Pokud si nevyhnutelně musíte Windows na počítači ponechat, měli by jste jej buď nastavit, aby si udržel CMOS hodiny jako UTC (nastavení registrového klíče <literal>HKLM\SYSTEM\CurrentControlSet\Control\TimeZoneInformation\RealTimeIsUniversal</literal> na “1” jako DWORD) nebo použít <command>hwclock --localtime --set</command> na systému Debian a nastavit tak hardwarové hodiny a označit je, že následují místní čas (a ujistit se, že manuálně zkontrolujete svůj čas na jaře a na podzim).

source: Time Synchronization
cs_cz: Časová synchronizace

source: <primary>time synchronization</primary>
cs_cz: <primary>časová synchronizace</primary>

source: <primary>clock</primary><secondary>synchronization</secondary>
cs_cz: <primary>hodiny</primary><secondary>synchronizace</secondary>

source: Time synchronization, which may seem superfluous on a computer, is very important on a network. Since users do not have permissions allowing them to modify the date and time, it is important for this information to be precise to prevent confusion. Furthermore, having all of the computers on a network synchronized allows better cross-referencing of information from logs on different machines. Thus, in the event of an attack, it is easier to reconstruct the chronological sequence of actions on the various machines involved in the compromise. Data collected on several machines for statistical purposes won't make a great deal of sense if they are not synchronized.
cs_cz: Časová synchronizace, jakkoli se může zdát na počítači nadbytečná, je velmi důležitá v síti. Protože uživatelé nemají povolení k pozměňování datumu a času, je pro tuto informaci důležité, aby byla přesná a zamezila tak zmatkům. Navíc, to, že máte všechny počítače v síti synchronizované, umožňuje lepší vzájemné porovnávání informací z logů na různých počítačích. Takže, v případě útoku je jednodušší rekonstruovat časové sekvence akcí na různých zařízeních zapletených do nalomení. Sběr dat na různých počítačích pro statistické účely nebude dávat valný smysl, pokud nebudou synchronizovány.

source: <emphasis>BACK TO BASICS</emphasis> NTP
cs_cz: <emphasis>ZPĚT K ZÁKLADŮM</emphasis> NTP

source: <primary>Network</primary><secondary>Time Protocol</secondary>
cs_cz: <primary>Síť</primary><secondary>Časový protokol</secondary>

source: NTP (Network Time Protocol) allows a machine to synchronize with others fairly accurately, taking into consideration the delays induced by the transfer of information over the network and other possible offsets.
cs_cz: NTP (Network Time Protocol) umožňuje zařízení, aby se synchronizovalo s ostatními velice přesně, s tím, že bere v úvahu zpoždění vyvolaná přenosem informací sítí a další možné kompenzace.

source: While there are numerous NTP servers on the Internet, the more popular ones may be overloaded. This is why we recommend using the <emphasis>pool.ntp.org</emphasis> NTP server, which is, in reality, a group of machines that have agreed to serve as public NTP servers. You could even limit use to a sub-group specific to a country, with, for example, <emphasis>us.pool.ntp.org</emphasis> for the United States, or <emphasis>ca.pool.ntp.org</emphasis> for Canada, etc.
cs_cz: I když je na internetu mnoho NTP serverů, ty populárněnší mohou být přehlcené. Proto doporučujeme použití NTP serveru <emphasis>pool.ntp.org</emphasis>, který je ve skutečnosti skupinou zařízení, co souhlasila, že bude sloužit jako veřejný NTP server. Můžete dokonce omezit použití na podskupinu specifickou pro určitou zemi, pomocí, například, <emphasis>us.pool.ntp.org</emphasis> pro USA nebo <emphasis>ca.pool.ntp.org</emphasis> pro Kanadu apod.

source: However, if you manage a large network, it is recommended that you install your own NTP server, which will synchronize with the public servers. In this case, all the other machines on your network can use your internal NTP server instead of increasing the load on the public servers. You will also increase homogeneity with your clocks, since all the machines will be synchronized on the same source, and this source is very close in terms of network transfer times.
cs_cz: Nicméně, pokud řídíte rozsáhlou síť, doporučuje se si nainstalovat svůj vlastní NTP server, který bude synchronizován s veřejnými servery. V tomto případě budou všechny ostatní zařízení na síti moci použít váš interní NTP server namísto navyšování zatížení na veřejných serverech. Také navýšíte homogenitu se svými hodinami, protože všechna zařízení budou synchronizována s tím samým zdrojem a tento zdroj je velice blízko co do síťových přenosných časů.

source: For Workstations
cs_cz: Pro pracovní stanice

source: Since work stations are regularly rebooted (even if only to save energy), synchronizing them by NTP at boot is enough. To do so, simply install the <emphasis role="pkg">ntpdate</emphasis> package. You can change the NTP server used if needed by modifying the <filename>/etc/default/ntpdate</filename> file.
cs_cz: Protože se pracovní stanice pravidelně opakované bootují (i když pouze kvůli úspoře energie), jejich synchronizace pomocí NTP při bootování je dostatečné. Aby jste to udělali, jednoduše nainstalujte balíček <emphasis role="pkg">ntpdate</emphasis>. Můžete změnit používaný NTP server, tím, že změníte soubor <filename>/etc/default/ntpdate</filename>.

source: For Servers
cs_cz: Pro servery

source: Servers are only rarely rebooted, and it is very important for their system time to be correct. To permanently maintain correct time, you would install a local NTP server, a service offered in the <emphasis role="pkg">ntp</emphasis> package. In its default configuration, the server will synchronize with <emphasis>pool.ntp.org</emphasis> and provide time in response to requests coming from the local network. You can configure it by editing the <filename>/etc/ntp.conf</filename> file, the most significant alteration being the NTP server to which it refers. If the network has a lot of servers, it may be interesting to have one local time server which synchronizes with the public servers and is used as a time source by the other servers of the network.
cs_cz: Servery se bootují jen velice zřídka a je pro jejich systémový čas velice důležité, aby byl správný. Aby se stále udržoval správný čas, nainstalovali by jste místní NTP server, službu nabízenou v balíčku <emphasis role="pkg">ntp</emphasis>. V tomto výchozím nastavení se bude server synchronizovat s <emphasis>pool.ntp.org</emphasis> a proskytovat čas jako odpověď na požadavky přicházejíví z místní sítě. To můžete nastavit editováním souboru <filename>/etc/ntp.conf</filename>, nejvýraznější změnou je NTS Server, na který odkazuje. Pokud má síť více serverů, může být zajímavé mít jeden místní časový server, který se synchronizuje s veřejnými servery a je použitý jako zdroj času pro ostatní servery v síti.

source: <emphasis>GOING FURTHER</emphasis> GPS modules and other time sources
cs_cz: <emphasis>JDEME DÁLE</emphasis> GPS moduly a další časové zdroje

source: If time synchronization is particularly crucial to your network, it is possible to equip a server with a GPS module (which will use the time from GPS satellites) or a DCF-77 module (which will sync time with the atomic clock near Frankfurt, Germany). In this case, the configuration of the NTP server is a little more complicated, and prior consultation of the documentation is an absolute necessity.
cs_cz: Pokud je pro vás časová synchronizace obzvláště klíčová, je možné vybavit server GPS modulem (který použije čas z GPS satelitu) nebo DCF-77 module (který se synchronizuje s atomovými hodinami poblíž Frankfurtu v Německu). V tomto případě je nastavení NTP serveru o něco komplikovanější a nahlédnutí do dokumentace předem je abslutní nutnost.

source: Rotating Log Files
cs_cz: Rotace Log souborů

source: <primary>file</primary><secondary>logs, rotation</secondary>
cs_cz: <primary>soubor<iprimary><secondary>logů, rotace</secondary>

source: <primary>rotation of log files</primary>
cs_cz: <primary>rotace logových souborů</primary>

source: Log files can grow, fast, and it is necessary to archive them. The most common scheme is a rotating archive: the log file is regularly archived, and only the latest <replaceable>X</replaceable> archives are retained. <command>logrotate</command>, the program responsible for these rotations, follows directives given in the <filename>/etc/logrotate.conf</filename> file and all of the files in the <filename>/etc/logrotate.d/</filename> directory. The administrator may modify these files, if they wish to adapt the log rotation policy defined by Debian. The <citerefentry><refentrytitle>logrotate</refentrytitle> <manvolnum>1</manvolnum></citerefentry> man page describes all of the options available in these configuration files. You may want to increase the number of files retained in log rotation, or move the log files to a specific directory dedicated to archiving them rather than delete them. You could also send them by e-mail to archive them elsewhere.
cs_cz: Logové soubory mohou rychle růst a je nutné je archivovat. Nejběžnějším scénářem je rotační archiv: logový soubor je pravidelně archivován a pouze posledních <replaceable>X</replaceable> archivů se uchovává. <command>logrotate</command>, program, který je zodpovědný za tyto rotace, následuje direktivy stanovené v souboru <filename>/etc/logrotate.conf</filename> a všech souborech v adresáři <filename>/etc/logrotate.d/</filename>. Administrátor může tyto soubory modifikovat, pokud si chce logovou politiku rotací definovanou Debianem, přizpůsobit. Manuálová stránka <citerefentry><refentrytitle>logrotate</refentrytitle> <manvolnum>1</manvolnum></citerefentry> popisuje veškeré, v těchto nastavovacích souborech možné, volby. Můžete chtít zvýšit počet uchovávaných souborů v logové rotaci nebo přesunout logové soubory do určitého, pouze jim věnovaného, adresáře raději, než je mazat. Můžete je také poslat emailem a archivovat je někde jinde.

source: The <command>logrotate</command> program is executed daily by the <command>cron</command> scheduling program (described in <xref linkend="sect.task-scheduling-cron-atd" />).
cs_cz: Program <command>logrotate</command> je spouštěn denně plánovacím programem <command>cron</command> (popsaným v <xref linkend="sect.task-scheduling-cron-atd" />).

source: Sharing Administrator Rights
cs_cz: Sdílení administrátorských práv

source: <primary>account</primary><secondary>administrator account</secondary>
cs_cz: <primary>účet</primary><secondary>administrátorský účet</secondary>

source: Frequently, several administrators work on the same network. Sharing the root passwords is not very elegant, and opens the door for abuse due to the anonymity such sharing creates. The solution to this problem is the <command>sudo</command> program, which allows certain users to execute certain commands with special rights. In the most common use case, <command>sudo</command> allows a trusted user to execute any command as root. To do so, the user simply executes <command>sudo <replaceable>command</replaceable></command> and authenticates using their personal password.
cs_cz: Často pracuje více administrátorů na té samé síti. Sdílení kmenových hesel není příliš elegantní a otevírá dveře zneužití kvůli anonymitě, kterou sdílení přináší. Řešením tohoto problému je program <command>sudo</command>, který pomocí speciálních práv umožňuje určitým uživatelům spouštět určité příkazy. Nejběžnějším případem použití je, že <command>sudo</command> umožňuje důvěryhodnému uživateli spouštět jakýkoli příkaz jako root. Aby tak uživatel učinil, jednoduše spustí <command>sudo <replaceable>příkaz</replaceable></command> a prokáže se použitím svého osobního hesla.

source: When installed, the <emphasis role="pkg">sudo</emphasis> package gives full root rights to members of the <literal>sudo</literal> Unix group. To delegate other rights, the administrator must use the <command>visudo</command> command, which allows them to modify the <filename>/etc/sudoers</filename> configuration file (here again, this will invoke the <command>vi</command> editor, or any other editor indicated in the <varname>EDITOR</varname> environment variable). Adding a line with <literal><replaceable>username</replaceable> ALL=(ALL) ALL</literal> allows the user in question to execute any command as root.
cs_cz: Po nainstalování dává balíček <emphasis role="pkg">sudo</emphasis> členům Unixové skupiny <literal>sudo</literal> plná kmenová práva. Pro delgování dalších práv musí administrátor použít příkaz <command>visudo</command>, který mu umožňuje změnit nastavovací soubor <filename>/etc/sudoers</filename> (zde znuvu, to vyvolá textový procesor <command>vi</command> nebo nějaký jiný procesor označený v proměnné prostředí <varname>EDITOR</varname>). Přidáním řádku <literal><replaceable>uživatel</replaceable> ALL=(ALL) ALL</literal> umožníte danému uživateli spouštět jakýkoli příkaz jako root.

source: More sophisticated configurations allow authorization of only specific commands to specific users. All the details of the various possibilities are given in the <citerefentry><refentrytitle>sudoers</refentrytitle> <manvolnum>5</manvolnum></citerefentry> man page.
cs_cz: Sofistikovanější nastavení umožní autorizaci pouze některých příkazů některým uživatelům. Všechny detaily různých možností jsou uvedeny v manuálové stránce <citerefentry><refentrytitle>sudoers</refentrytitle> <manvolnum>5</manvolnum></citerefentry>.

source: List of Mount Points
cs_cz: Seznam bodů přimontování

source: <primary>point, mount</primary>
cs_cz: <primary>bod, přimontování</primary>

source: <primary>mount point</primary>
cs_cz: <primary>montovací bod</primary>

source: <emphasis>BACK TO BASICS</emphasis> Mounting and unmounting
cs_cz: <emphasis>ZPĚT K ZÁKLADŮM</emphasis> Přimontování a odmontování

source: In a Unix-like system such as Debian, files are organized in a single tree-like hierarchy of directories. The <filename>/</filename> directory is called the “root directory”; all additional directories are sub-directories within this root. “Mounting” is the action of including the content of a peripheral device (often a hard drive) into the system's general file tree. As a consequence, if you use a separate hard drive to store users' personal data, this disk will have to be “mounted” in the <filename>/home/</filename> directory. The root filesystem is always mounted at boot by the kernel; other devices are often mounted later during the startup sequence or manually with the <command>mount</command> command.
cs_cz: V unixovských systémech jeko Debian jsou soubory organizovány v jediné stromu podobné hierarchii adresářů. Adresář <filename>/</filename> se nazývá “kmenový adrsář”; všechny další adresáře jsou podadresáře v rámci tohoto rootu. “Přimontování” je akce spočívající v zahrnutí obsahu periferního zařízení (často pevného disku) do celkového souborového stromu systému. Následkem toho, pokud používáte oddělený disk k ukládání uživatelských osobních dat, disk musí být “přimontovám” do adresáře <filename>/home/</filename>. Kmenový souborový systém je vždy přimontován při bootování jádra; ostatní zařízení jsou často přimontována později během spouštěcí sekvence nebo manuálně pomocí příkazu <command>mount</command>.

source: Some removable devices are automatically mounted when connected, especially when using the GNOME, KDE or other graphical desktop environments. Others have to be mounted manually by the user. Likewise, they must be unmounted (removed from the file tree). Normal users do not usually have permission to execute the <command>mount</command> and <command>umount</command> commands. The administrator can, however, authorize these operations (independently for each mount point) by including the <literal>user</literal> option in the <filename>/etc/fstab</filename> file.
cs_cz: Některá odpojitelná zařízení jsou automaticky přimontována, jakmile jsou připojena, zvláště při používání GNOME, KDE nebo jiných grafických desktopových prostředí. Ostatní musí být přimontována manuálně uživatelem. Podobným způsobem musí být i odmontována (odstraněna ze souborového stromu). Běžní uživatelé obyčejně nemají povolení ke spouštění příkazů <command>mount</command> a <command>umount</command>. Nicméně administrátor může autorizovat tyto operace (nezávisle pro každý bod přimontování) tím, že přidá volbu <literal>user</literal> do souboru <filename>/etc/fstab</filename>.

source: The <command>mount</command> command can be used without arguments (it then lists all mounted filesystems). The following parameters are required to mount or unmount a device. For the complete list, please refer to the corresponding man pages, <citerefentry><refentrytitle>mount</refentrytitle> <manvolnum>8</manvolnum></citerefentry> and <citerefentry><refentrytitle>umount</refentrytitle> <manvolnum>8</manvolnum></citerefentry>. For simple cases, the syntax is simple too: for example, to mount the <filename>/dev/sdc1</filename> partition, which has an ext3 filesystem, into the <filename>/mnt/tmp/</filename> directory, you would simply run <command>mount -t ext3 /dev/sdc1 /mnt/tmp/</command>.
cs_cz: Příkaz <command>mount</command> může být použit bez argumentů (ten potom vypíše seznam všech přimontovaných souborových systémů). Následující parametry jsou požadovány pro přimontování nebo odmontování zařízení. Pro kompletní seznam prosím nahlédněte do odpovídajících manuálových stránek, <citerefentry><refentrytitle>mount</refentrytitle> <manvolnum>8</manvolnum></citerefentry> a <citerefentry><refentrytitle>umount</refentrytitle> <manvolnum>8</manvolnum></citerefentry>. Pro jednoduché případy je syntax také jednoduchý: například pro přimontování oddělení <filename>/dev/sdc1</filename>, které má souborový systém ext3 do adresáře <filename>/mnt/tmp/</filename>, jednoduše spustíte <command>mount -t ext3 /dev/sdc1 /mnt/tmp/</command>.

source: The <filename>/etc/fstab</filename> file gives a list of all possible mounts that happen either automatically on boot or manually for removable storage devices. Each mount point is described by a line with several space-separated fields: <indexterm><primary><filename>fstab</filename></primary></indexterm> <indexterm><primary><filename>/etc/fstab</filename></primary></indexterm>
cs_cz: Soubor <filename>/etc/fstab</filename> poskytuje seznam všech možných přimontování, která se dějí ať už automaticky nebo manuálně v případě odpojitelných úložných zařízení. Každý montovací bod je popsán řádkem s několika mezerou oddělenými poli: <indexterm><primary><filename>fstab</filename></primary></indexterm> <indexterm><primary><filename>/etc/fstab</filename></primary></indexterm>.

source: device to mount: this can be a local partition (hard drive, CD-ROM) or a remote filesystem (such as NFS).
cs_cz: zařízení k přimontování: to může být místní oddělení (pevný disk, CD-ROM) nebo vzdálený souborový systém (jako NFS).

source: This field is frequently replaced with the unique ID of the filesystem (which you can determine with <command>blkid <userinput>device</userinput></command>) prefixed with <literal>UUID=</literal>. This guards against a change in the name of the device in the event of addition or removal of disks, or if disks are detected in a different order.
cs_cz: Toto pole je často nahrazeno unikátním ID souborového systému (které můžete určit pomocí <command>blkid <userinput>device</userinput></command>) s prefixem <literal>UUID=</literal>. To brání změně ve jménu zařízení v případě přidání nebo odstranění disků nebo pokud jsou disky rozpoznány v odlišném pořadí.

source: mount point: this is the location on the local filesystem where the device, remote system, or partition will be mounted.
cs_cz: bod přimontování: toto je místo v lokálním souborovém systému, kam se zařízení, vzdálený systém nebo oddíl namontuje.

source: type: this field defines the filesystem used on the mounted device. <literal>ext4</literal>, <literal>ext3</literal>, <literal>vfat</literal>, <literal>ntfs</literal>, <literal>btrfs</literal>, <literal>xfs</literal> are a few examples.
cs_cz: type: toto pole stanovuje souborový systém, který se na namontovaném zařízení používá. <literal>ext4</literal>, <literal>ext3</literal>, <literal>vfat</literal>, <literal>ntfs</literal>, <literal>btrfs</literal>, <literal>xfs</literal> je pár příkladů.

source: <emphasis>BACK TO BASICS</emphasis> NFS, a network filesystem
cs_cz: <emphasis>ZPĚT K ZÁKLADŮM</emphasis> NFS, souborový systém sítě

source: NFS is a network filesystem; under Linux, it allows transparent access to remote files by including them in the local filesystem.
cs_cz: NFS je souborový systém sítě; pod Linuxem, umožňuje transparentní přístup ke vzdáleným souborům tím, že je zahrne do místního souborového systému.
