Repository: jarabt/Hbook
Catalog: 08_basic-configuration.po
Languages: cs_cz

source: A complete list of known filesystems is available in the <citerefentry><refentrytitle>mount</refentrytitle> <manvolnum>8</manvolnum></citerefentry> man page. The <literal>swap</literal> special value is for swap partitions; the <literal>auto</literal> special value tells the <command>mount</command> program to automatically detect the filesystem (which is especially useful for disk readers and USB keys, since each one might have a different filesystem);
cs_cz: Kompletní seznam známých souborových systémů je k dispozici na manuálové stránce <citerefentry><refentrytitle>mount</refentrytitle> <manvolnum>8</manvolnum></citerefentry>. Speciální hodnota <literal>swap</literal> je pro oddíly swap; speciální hodnota <literal>auto</literal> říká programu <command>mount</command>, aby automaticky detekoval souborový systém (který je zvláště užitečný pro čtečky disků a USB flash disky, protože každý může mít jiný souborový systém);

source: options: there are many of them, depending on the filesystem, and they are documented in the <command>mount</command> man page. The most common are
cs_cz: volby: existuje je jich mnoho, v závislosti na souborovém systému a jsou zdokumentovány na manuálové stránce příkazu <command>mount</command>. Nejběžnější jsou

source: <literal>rw</literal> or <literal>ro</literal>, meaning, respectively, that the device will be mounted with read/write or read-only permissions.
cs_cz: <literal>rw</literal> nebo <literal>ro</literal> respektive, znamená, že zařízení bude namontováno s povolením read/write nebo read-only.

source: <literal>noauto</literal> deactivates automatic mounting on boot.
cs_cz: <literal>noauto</literal> deaktivuje automatické namontování při bootování.

source: <literal>nofail</literal> allows the boot to proceed even when the device is not present. Make sure to put this option for external drives that might be unplugged when you boot, because <command>systemd</command> really ensures that all mount points that must be automatically mounted are actually mounted before letting the boot process continue to its end. Note that you can combine this with <literal>x-systemd.device-timeout=5s</literal> to tell <command>systemd</command> to not wait more than 5 seconds for the device to appear (see <citerefentry><refentrytitle>systemd.mount</refentrytitle><manvolnum>5</manvolnum></citerefentry>).
cs_cz: <literal>nofail</literal> umožňuje proces bootování i když zařízení není přítomné. Ujistěte se, že zadáte tuto volbu ve vztahu k externím zařízením, které mohou být odpojené při bootování, protože <command>systemd</command> se opravdu ujišťuje, že všechny body k montování, které musí být automaticky namontovány jsou opravdu namontovány pře tím, než povolí bootovacímu procesu pokračovat až do svého ukončení. Poukazujeme na to, že toto můžete kombinovat s <literal>x-systemd.device-timeout=5s</literal> a říci tak <command>systemd</command>, aby nečekal déle než 5 sekund na výskyt zařízení (viz. <citerefentry><refentrytitle>systemd.mount</refentrytitle><manvolnum>5</manvolnum></citerefentry>).

source: <literal>user</literal> authorizes all users to mount this filesystem (an operation which would otherwise be restricted to the root user).
cs_cz: <literal>user</literal> autorizuje všechny uživatel k používání tohoto souborového systému (operace, která by jinak byla omezena na kořenového uživatele).

source: <literal>defaults</literal> means the group of default options: <literal>rw</literal>, <literal>suid</literal>, <literal>dev</literal>, <literal>exec</literal>, <literal>auto</literal>, <literal>nouser</literal> and <literal>async</literal>, each of which can be individually disabled after <literal>defaults</literal> by adding <literal>nosuid</literal>, <literal>nodev</literal> and so on to block <literal>suid</literal>, <literal>dev</literal> and so on. Adding the <literal>user</literal> option reactivates it, since <literal>defaults</literal> includes <literal>nouser</literal>.
cs_cz: <literal>defaults</literal> znamená skupinu přednastavených voleb <literal>rw</literal>, <literal>suid</literal>, <literal>dev</literal>, <literal>exec</literal>, <literal>auto</literal>, <literal>nouser</literal> a <literal>async</literal>, kde každá z nich může být individuálně vyřazena z činnosti po <literal>defaults</literal> s přidáním <literal>nosuid</literal>, <literal>nodev</literal> a podobně, za účelem zablokování <literal>suid</literal>, <literal>dev</literal> apod. Přidání volby <literal>user</literal> jej znova aktivuje, protože <literal>defaults</literal> zahrnuje <literal>nouser</literal>.

source: backup: this field is almost always set to <literal>0</literal>. When it is <literal>1</literal>, it tells the <command>dump</command> tool that the partition contains data that is to be backed up.
cs_cz: backup: toto pole je skoro vždy nastaveno na <literal>0</literal>. Pokud je <literal>1</literal>, sděluje nástroji <command>dump</command>, že oddíl obsahuje data, která se mají zálohovat.

source: check order: this last field indicates whether the integrity of the filesystem should be checked on boot, and in which order this check should be executed. If it is <literal>0</literal>, no check is conducted. The root filesystem should have the value <literal>1</literal>, while other permanent filesystems get the value <literal>2</literal>.
cs_cz: check order: toto poslední pole značí, zda by měla být při bootování zkontrolována integrita souborového systému a v jakém pořadí by tato kontrola měla být provedena. Pokud je <literal>0</literal>, není žádná kontrola prováděna. Kmenový souborový systém by měl mít hodnotu <literal>1</literal>, zatímco ostatní permanentní souborové systémy dostanou hodnotu <literal>2</literal>.

source: Example <filename>/etc/fstab</filename> file
cs_cz: Příklad souboru <filename>/etc/fstab</filename>

source: The last entry in this example corresponds to a network filesystem (NFS): the <filename>/shared/</filename> directory on the <emphasis>arrakis</emphasis> server is mounted at <filename>/shared/</filename> on the local machine. The format of the <filename>/etc/fstab</filename> file is documented on the <citerefentry><refentrytitle>fstab</refentrytitle><manvolnum>5</manvolnum></citerefentry> man page.
cs_cz: Poslední záznam v tomto příkladu odpovídá síťovému souborovému systému (NFS): adresář <filename>/shared/</filename> na serveru <emphasis>arrakis</emphasis> je namontován na <filename>/shared/</filename> na lokálním zařízení. Formát souboru <filename>/etc/fstab</filename> je zdokumentován na manuálové stránce <citerefentry><refentrytitle>fstab</refentrytitle><manvolnum>5</manvolnum></citerefentry<citerefentry>.

source: The <emphasis>am-utils</emphasis> package provides the <command>amd</command> auto-mounting utility, able to mount removable media on demand when a user attempts to access their usual mount point. It will unmount these devices when no process is accessing them any longer.
cs_cz: Balíček <emphasis>am-utils</emphasis> poskytuje program pro auto-mounting <command>amd</command>, který je schopen namontovat odnímatelná média na vyžádání, pokud uživatel přistoupí k jeho běžnému montovacímu bodu. To odmontuje tato zařízení, pokud sem nepřistupuje již více žádný proces.

source: Other auto-mounting utilities exist, such as <command>automount</command> in the <emphasis>autofs</emphasis> package.
cs_cz: Existují další programy pro automatické montování, jako je <command>automount</command> v balíčku <emphasis>autofs</emphasis>.

source: Note also that GNOME, KDE, and other graphical desktop environments work together with <emphasis>udisks</emphasis>, and can automatically mount removable media when they are connected.
cs_cz: Upozorňujeme na to, že GNOME, KDE a další grafická desktopová prostředí pracují společně s <emphasis>udisks</emphasis> a mohou automaticky montovat odnímatelná média, podkud se připojí.

source: The <command>locate</command> command can find the location of a file when you only know part of the name. It sends a result almost instantaneously, since it consults a database that stores the location of all the files on the system; this database is updated daily by the <command>updatedb</command> command. There are multiple implementations of the <command>locate</command> command and Debian picked <emphasis role="pkg">mlocate</emphasis> for its standard system.
cs_cz: Příkaz <command>locate</command> může nalézt umístění souboru, pokud znáte pouze část jeho jména. Pošle výsledek téměř okamžitě, protože nahlíží do databáze, která ukládá umístění všech souborů v systému; tato databáze je aktualizovaná denně příkazem <command>updatedb</command>. Existuje hodně implementací příkazu <command>locate</command> a Debian si vybral <emphasis role="pkg">mlocate</emphasis> pro svůj standardní systém.

source: <command>mlocate</command> is smart enough to only return files which are accessible to the user running the command even though it uses a database that knows about all files on the system (since its <command>updatedb</command> implementation runs with root rights). For extra safety, the administrator can use <varname>PRUNEDPATHS</varname> in <filename>/etc/updatedb.conf</filename> to exclude some directories from being indexed.
cs_cz: <command>mlocate</command> je dostatečně chytrý na to, aby vrátil pouze soubory, které jsou přístupné uživateli, který spouští program, i když zná všechny soubory v systému (protože jeho implementace <command>updatedb</command> běží s rootovskými právy). Pro zvláštní bezpečnost, amdinistrátor může použít <varname>PRUNEDPATHS</varname> in <filename>/etc/updatedb.conf</filename> a vyloučit tak některé adresáře z indexování.

source: Compiling a Kernel
cs_cz: Sestavování jádra

source: <primary>compilation</primary><secondary>of a kernel</secondary>
cs_cz: <primary>sestavení</primary><secondary>jádra</secondary>

source: <primary>kernel</primary><secondary>compilation</secondary>
cs_cz: <primary>jádra</primary><secondary>sestavení</secondary>

source: The kernels provided by Debian include the largest possible number of features, as well as the maximum of drivers, in order to cover the broadest spectrum of existing hardware configurations. This is why some users prefer to recompile the kernel in order to only include what they specifically need. There are two reasons for this choice. First, it may be to optimize memory consumption, since the kernel code, even if it is never used, occupies memory for nothing (and never “goes down” on the swap space, since it is actual RAM that it uses), which can decrease overall system performance. A locally compiled kernel can also limit the risk of security problems since only a fraction of the kernel code is compiled and run.
cs_cz: Jádra poskytovaná Debianem obsahují největší možnou funkcionalitu, stejně jako maximum ovladačů, za účelem pokrytí nejširšího spektra existujících hardwarových sestav. To je důvod, proč někteří uživatelé upřednostňují opakované sestavení jádra za účelem zahrnutí pouze toho, co přesně potřebují. Jsou dva důvody pro tuto volbu. Zaprvé, může být optimalizace spotřeby paměti, protože kód jádra, i když se nikdy nepoužije, zabírá paměť pro nic (a nikdy “neschází” na virtuální paměť, protože to je skutečná RAM paměť, co používá), což snižuje všeobecný výkon systému. Místně sestavené jádro může také snižovat riziko bezpečnostních problémů, protože pouze zlomek kódu jádra je sestaven a spuštěn.

source: <emphasis>NOTE</emphasis> Security updates
cs_cz: <emphasis>POZNÁMKA</emphasis> Bezpečnostní aktualizace

source: If you choose to compile your own kernel, you must accept the consequences: Debian cannot ensure security updates for your custom kernel. By keeping the kernel provided by Debian, you benefit from updates prepared by the Debian Project's security team.
cs_cz: Pokud se rozhodnete sestavit vaše vlastní jádro, musíte se smířit s důsledky: Debian nemůže zabezpečit bezpečnostní aktualizace pro vaše vlastní jádro. Ponecháním si jádra poskytnutého Debianem, budete profitovat z aktualizací připravených Týmem pro bezpečnost projektu Debianu.

source: Recompilation of the kernel is also necessary if you want to use certain features that are only available as patches (and not included in the standard kernel version).
cs_cz: Opětovné sestavení jádra je také nutné, pokud chcete použít určitou funkcionalitu, která je dostupná pouze formou oprav (a není tak zahrnuta do standardní verze jádra).

source: <emphasis>GOING FURTHER</emphasis> The Debian Kernel Handbook
cs_cz: <emphasis>JDEME DÁLE</emphasis> Příručka jádra Debianu

source: The Debian kernel teams maintains the “Debian Kernel Handbook” (also available in the <emphasis role="pkg">debian-kernel-handbook</emphasis> package) with comprehensive documentation about most kernel related tasks and about how official Debian kernel packages are handled. This is the first place you should look into if you need more information than what is provided in this section. <ulink type="block" url="http://kernel-handbook.alioth.debian.org" />
cs_cz: Týmy pro jádro spravují “Debian Kernel Handbook” (také dostupnou v balíčku <emphasis role="pkg">debian-kernel-handbook</emphasis>) s kompletní dokumentací o většině úkolů souvisejících s jádrem a o tom, jak se s oficiálními balíčky jádra Debianu zachází. Toto je první místo, kam by jste se měli podívat, pokud potřebujete více informací, než je obsaženo v této sekci. <ulink type="block" url="http://kernel-handbook.alioth.debian.org" />

source: Introduction and Prerequisites
cs_cz: Úvod a nezbytné předpoklady

source: Unsurprisingly Debian manages the kernel in the form of a package, which is not how kernels have traditionally been compiled and installed. Since the kernel remains under the control of the packaging system, it can then be removed cleanly, or deployed on several machines. Furthermore, the scripts associated with these packages automate the interaction with the bootloader and the initrd generator.
cs_cz: Není překvapením, že Debian řídí jádro formou balíčků, což není způsob, jakým byla jádra tradičně sestavována a instalována. Protože jádro zůstává pod kontrolou balíčkovacího systému, může tak být čistě odstraněno nebo nasazeno na několik zařízení. Navíc, skripty vztažené k těmto balíčkům automatizují spolupráci s bootloaderem a generátorem initrd.

source: The upstream Linux sources contain everything needed to build a Debian package of the kernel. But you still need to install <emphasis role="pkg">build-essential</emphasis> to ensure that you have the tools required to build a Debian package. Furthermore, the configuration step for the kernel requires the <emphasis role="pkg">libncurses5-dev</emphasis> package. Finally, the <emphasis role="pkg">fakeroot</emphasis> package will enable creation of the Debian package without using administrator's rights.
cs_cz: Upstreamové Linuxové zdroje obsahují vše potřebné k sestavení balíčku Debianu pro jádro. Ale stále musíte nainstalovat <emphasis role="pkg">build-essential</emphasis>, aby jste se ujistili, že máte nástroje potřebné k postavení balíčku Debianu. Navíc, nastavovací krok pro jádro vyžaduje balíček <emphasis role="pkg">libncurses5-dev</emphasis>. Nakonec, balíček <emphasis role="pkg">fakeroot</emphasis> umožní vytvoření balíčku Debianu bez využití administrátorských práv.

source: <emphasis>CULTURE</emphasis> The good old days of <emphasis role="pkg">kernel-package</emphasis>
cs_cz: <emphasis>KULTURA</emphasis> Staré dobré časy <emphasis role="pkg">kernel-package</emphasis>

source: Before the Linux build system gained the ability to build proper Debian packages, the recommended way to build such packages was to use <command>make-kpkg</command> from the <emphasis role="pkg">kernel-package</emphasis> package.
cs_cz: Před tím, než linuxovský stavební systém získal schopnost stavět správné balíčky Debianu, spočíval doporučený způsob stavby takových balíčků v použití <command>make-kpkg</command> z balíčku <emphasis role="pkg">kernel-package</emphasis>.

source: Getting the Sources
cs_cz: Získání zdrojů

source: <primary>Linux kernel sources</primary>
cs_cz: <primary>zdroje jádra Linuxu</primary>

source: <primary>kernel</primary><secondary>sources</secondary>
cs_cz: <primary>jádro</primary><secondary>zdroje</secondary>

source: <primary>source</primary><secondary>of the Linux kernel</secondary>
cs_cz: <primary>zdroj</primary><secondary>jádra Linuxu</secondary>

source: Like anything that can be useful on a Debian system, the Linux kernel sources are available in a package. To retrieve them, just install the <emphasis role="pkg">linux-source-<replaceable>version</replaceable></emphasis> package. The <command>apt-cache search ^linux-source</command> command lists the various kernel versions packaged by Debian. The latest version is available in the <emphasis role="distribution">Unstable</emphasis> distribution: you can retrieve them without much risk (especially if your APT is configured according to the instructions of <xref linkend="sect.apt-mix-distros" />). Note that the source code contained in these packages does not correspond precisely with that published by Linus Torvalds and the kernel developers; like all distributions, Debian applies a number of patches, which might (or might not) find their way into the upstream version of Linux. These modifications include backports of fixes/features/drivers from newer kernel versions, new features not yet (entirely) merged in the upstream Linux tree, and sometimes even Debian specific changes.
cs_cz: Jako cokoli, co je použitelné na systému Debian, jsou zdroje jádra Linuxu dostupné v balíčku. K jejich získání stačí nainstalovat balíček <emphasis role="pkg">linux-source-<replaceable>verze</replaceable></emphasis>. Příkaz <command>apt-cache search ^linux-source</command> prochází různé verze jádra zabalené Debianem. Poslední verze je dostupná v distriubuci <emphasis role="distribution">Unstable</emphasis>: můžete ji získat vcelku bez rizika (zvláště pokud je váš APT nastaven podle instrukcí <xref linkend="sect.apt-mix-distros" />). Za poznámku stojí, že zdrojový kód obsažený v těchto balíčcích přesně neodpovídá těm vydaným Linusem Torvaldsem a vývojářům jádra; jako všechny distribuce, Debian aplikuje množství oprav, které si mohou (nebo nemusí) najít svou cestu do upstreamové verze Linuxu. Tyto modifikace zahrnují backporty oprav/funkcí/ovladačů nejnovějších verzí jádra, nové funkcionality, které zatím nebyly (kompletně) zahrnuty do upstreamového stromu Linuxu a někdy i specifické změny od Debianu.

source: The remainder of this section focuses on the 3.16 version of the Linux kernel, but the examples can, of course, be adapted to the particular version of the kernel that you want.
cs_cz: Zbytek této sekce se zaměřuje na verzi 3.16 linuxovského jádra, ale příklady mohou být, samozřejmě, přizpůsobeny jakékoli verzi jádra chcete.

source: We assume the <emphasis role="pkg">linux-source-3.16</emphasis> package has been installed. It contains <filename>/usr/src/linux-source-3.16.tar.xz</filename>, a compressed archive of the kernel sources. You must extract these files in a new directory (not directly under <filename>/usr/src/</filename>, since there is no need for special permissions to compile a Linux kernel): <filename>~/kernel/</filename> is appropriate.
cs_cz: Předpokládejme, že máme nainstalovaný balíček <emphasis role="pkg">linux-source-3.16</emphasis>. Ten obsahuje komprimovaný archiv zdrojů jádra <emphasis role="pkg">linux-source-3.16</emphasis>. Tyto soubory musíte extrahovat do nového adresáře (ne přímo pod <filename>/usr/src/</filename>, protože ke kompilaci linuxovského jádra nepotřebujete žádná speciální povolení): <filename>~/kernel/</filename> je vhodný.

source: <emphasis>CULTURE</emphasis> Location of kernel sources
cs_cz: <emphasis>KULTURA</emphasis> Umístění zdrojů jádra

source: Traditionally, Linux kernel sources would be placed in <filename>/usr/src/linux/</filename> thus requiring root permissions for compilation. However, working with administrator rights should be avoided when not needed. There is a <literal>src</literal> group that allows members to work in this directory, but working in <filename>/usr/src/</filename> should be avoided nevertheless. By keeping the kernel sources in a personal directory, you get security on all counts: no files in <filename>/usr/</filename> unknown to the packaging system, and no risk of misleading programs that read <filename>/usr/src/linux</filename> when trying to gather information on the used kernel.
cs_cz: Podle zvyklostí by se zdroje linuxového jádra umístily do <filename>/usr/src/linux/</filename>, takže v případě kompilace by se vyžadovala kořenová oprávnění. Ovšem práci s administrátorskými právy by se mělo předejít, pokud nejsou nutná. Existuje skupina <literal>src</literal>, která umožňuje členům práci v tomto adresáři, ale práci v <filename>/usr/src/</filename> by jste se nicméně měli vyhnout. Tím, že máte zdroje jádra v samostatném adresáři, získáte zabezpečení ve všech bodech: žádné neznámé soubory v <filename>/usr/</filename> pro balíčkový systém a žádné riziko, že se uvedou v omyl programy, které čtou <filename>/usr/src/linux</filename> při pokusu o získání informací o použitém jádru.

source: Configuring the Kernel
cs_cz: Nastavení jádra

source: <primary>kernel</primary><secondary>configuration</secondary>
cs_cz: <primary>jádro</primary><secondary>nastavení</secondary>

source: <primary>configuration</primary><secondary>of the kernel</secondary>
cs_cz: <primary>nastavení</primary><secondary>jádra</secondary>

source: The next step consists of configuring the kernel according to your needs. The exact procedure depends on the goals.
cs_cz: Další krok spočívá v nastavení jádra podle vašich potřeb. Přesný postup závisí na cílech.

source: When recompiling a more recent version of the kernel (possibly with an additional patch), the configuration will most likely be kept as close as possible to that proposed by Debian. In this case, and rather than reconfiguring everything from scratch, it is sufficient to copy the <filename>/boot/config-<replaceable>version</replaceable></filename> file (the version is that of the kernel currently used, which can be found with the <command>uname -r</command> command) into a <filename>.config</filename> file in the directory containing the kernel sources.
cs_cz: Pokud znovukompilujete novější verzi jádra (možná obsahující dodatečnou opravu), nastavení se s největší pravděpodobností budou držet tak blízko těm navrženým Debianem, jak jen to bude možné. V tomto případě a spíše než přenastavování všeho od začátku, bude vhodné zkopírovat soubor <filename>/boot/config-<replaceable>verze</replaceable></filename> (verze je ta, kterou právě jádro používá, což může být zjištěno pomocí příkazu <command>uname -r</command>) do souboru <filename>.config</filename> v adresáři obsahujícím zdroje jádra.
