Repository: jarabt/Hbook
Catalog: 08_basic-configuration.po
Languages: cs_cz

source: Unless you need to change the configuration, you can stop here and skip to <xref linkend="sect.kernel-build" />. If you need to change it, on the other hand, or if you decide to reconfigure everything from scratch, you must take the time to configure your kernel. There are various dedicated interfaces in the kernel source directory that can be used by calling the <command>make <replaceable>target</replaceable></command> command, where <replaceable>target</replaceable> is one of the values described below.
cs_cz: Pokud nepotřebujete změnit nastavení, můžete tady skončit a přeskočit na <xref linkend="sect.kernel-build" />. Pokud jej na druhou stranu potřebujete změnit nebo pokud se rozhodnete znovukonfigurovat všechno kompletně od začátku, musíte obětovat čas a nastavit vaše jádro. K tomu existují různá rozhraní v adresáři zdroje jádra, která mohou být použita zavoláním příkazu <command>make <replaceable>cíl</replaceable></command>, kde <replaceable>cíl</replaceable> je jedna z hodnot popsaných níže.

source: <command>make menuconfig</command> compiles and executes a text-mode interface (this is where the <emphasis role="pkg">libncurses5-dev</emphasis> package is required) which allows navigating the options available in a hierarchical structure. Pressing the <keycap>Space</keycap> key changes the value of the selected option, and <keycap>Enter</keycap> validates the button selected at the bottom of the screen; <guibutton>Select</guibutton> returns to the selected sub-menu; <guibutton>Exit</guibutton> closes the current screen and moves back up in the hierarchy; <guibutton>Help</guibutton> will display more detailed information on the role of the selected option. The arrow keys allow moving within the list of options and buttons. To exit the configuration program, choose <guibutton>Exit</guibutton> from the main menu. The program then offers to save the changes you've made; accept if you are satisfied with your choices.
cs_cz: <command>make menuconfig</command> kompiluje a spouští rozhraní s textovým módem (tady budete potřebovat balíček <emphasis role="pkg">libncurses5-dev</emphasis>), který umožňuje navigaci napříč dostupnými volbami v hierarchické struktuře. Stisknutím klávesy <keycap>Space</keycap> změníte hodnotu vybrané možnosti a <keycap>Enter</keycap> potvrdí vybrané talčítko na spodu obrazovky; <guibutton>Select</guibutton> vrací do vybraného podmenu; <guibutton>Exit</guibutton> zavře současnou obrazovku a přesune vás v hierarchii zpět nahoru; <guibutton>Help</guibutton> zobrazí detailnější informace o funkci vybrané volby. Klávesy s šipkami umožňují pohyb v rámci seznamu možností a tlačítek. Pro ukončení nastavovacího programu vyberte <guibutton>Exit</guibutton> z hlavní nabídky. Poté program nabídne uložit provedené změny; akceptujte to, pokud jste se svým výběrem spokojeni.

source: Other interfaces have similar features, but they work within more modern graphical interfaces; such as <command>make xconfig</command> which uses a Qt graphical interface, and <command>make gconfig</command> which uses GTK+. The former requires <emphasis role="pkg">libqt4-dev</emphasis>, while the latter depends on <emphasis role="pkg">libglade2-dev</emphasis> and <emphasis role="pkg">libgtk2.0-dev</emphasis>.
cs_cz: Ostatní rozhraní mají podobnou funkcionalitu, ale pracují s použitím modernějších grafických rozhraní; jako je <command>make xconfig</command>, které používá grafické rozhraní Qt a <command>make gconfig</command>, které používá GTK+. To první vyžaduje <emphasis role="pkg">libqt4-dev</emphasis>, zatímco to druhé závisí na <emphasis role="pkg">libglade2-dev</emphasis> a <emphasis role="pkg">libgtk2.0-dev</emphasis>.

source: When using one of those configuration interfaces, it is always a good idea to start from a reasonable default configuration. The kernel provides such configurations in <filename>arch/<replaceable>arch</replaceable>/configs/*_defconfig</filename> and you can put your selected configuration in place with a command like <command>make x86_64_defconfig</command> (in the case of a 64-bit PC) or <command>make i386_defconfig</command> (in the case of a 32-bit PC).
cs_cz: Při použití jednoho z těchto nastavovacích rozhraní, je vždy dobrý nápad začít s rozumným výchozím nastavením. Jádro poskytuje takové nastavení v <filename>arch/<replaceable>arch</replaceable>/configs/*_defconfig</filename> a svou vybranou konfiguraci můžete umístit pomocí příkazu jako je <command>make x86_64_defconfig</command> (v případě 64-bit PC) nebo <command>make i386_defconfig</command> (v případě 32-bit PC).

source: <emphasis>TIP</emphasis> Dealing with outdated <filename>.config</filename> files
cs_cz: <emphasis>TIP</emphasis> Co se zastaralými soubory <filename>.config</filename>

source: When you provide a <filename>.config</filename> file that has been generated with another (usually older) kernel version, you will have to update it. You can do so with <command>make oldconfig</command>, it will interactively ask you the questions corresponding to the new configuration options. If you want to use the default answer to all those questions you can use <command>make olddefconfig</command>. With <command>make oldnoconfig</command>, it will assume a negative answer to all questions.
cs_cz: Pokud dodáváte soubor <filename>.config</filename>, který byl vygenerován pomocí jiné (obyčejně starší) verzí jádra, budete jej muset aktualizovat. Můžete to udělat za pomoci <command>make oldconfig</command>, který vám bude interaktivně klást otázky ohledně nových konfiguračních voleb. Pokud si budete přát použít přednastavené volby na všechny tyto dotazy, můžete použít <command>make olddefconfig</command>. Použitím <command>make oldnoconfig</command>, bude předpokládat negativní odpověď na všechny otázky.

source: Compiling and Building the Package
cs_cz: Kompilování a sestavování balíčku

source: <emphasis>NOTE</emphasis> Clean up before rebuilding
cs_cz: <emphasis>POZNÁMKA</emphasis> Úklid před sestavováním

source: If you have already compiled once in the directory and wish to rebuild everything from scratch (for example because you substantially changed the kernel configuration), you will have to run <command>make clean</command> to remove the compiled files. <command>make distclean</command> removes even more generated files, including your <filename>.config</filename> file too, so make sure to backup it first.
cs_cz: Pokud jste již jednou v adresáři sestavovali a přejete si znovu sestavit vše od úplného začátku (například protože jste podstatně změnili nastavení jádra), budete muset spustit <command>make clean</command> a odstranit tak zkompilované soubory. <command>make distclean</command> odstraní ještě více generovaných souborů, včetně vašeho souboru <filename>.config</filename>, takže se ujistěte, že ho nejdříve zálohujete.

source: Once the kernel configuration is ready, a simple <command>make deb-pkg</command> will generate up to 5 Debian packages: <emphasis role="pkg">linux-image-<replaceable>version</replaceable></emphasis> that contains the kernel image and the associated modules, <emphasis role="pkg">linux-headers-<replaceable>version</replaceable></emphasis> which contains the header files required to build external modules, <emphasis role="pkg">linux-firmware-image-<replaceable>version</replaceable></emphasis> which contains the firmware files needed by some drivers (this package might be missing when you build from the kernel sources provided by Debian), <emphasis role="pkg">linux-image-<replaceable>version</replaceable>-dbg</emphasis> which contains the debugging symbols for the kernel image and its modules, and <emphasis role="pkg">linux-libc-dev</emphasis> which contains headers relevant to some user-space libraries like GNU glibc.
cs_cz: Jakmile je nastavení jádra připraveno jednoduché zadání <command>make deb-pkg</command> vygeneruje do pěti balíčků Debianu: <emphasis role="pkg">linux-image-<replaceable>verze</replaceable></emphasis>, který zahrnuje obraz jádra a související moduly, <emphasis role="pkg">linux-headers-<replaceable>verze</replaceable></emphasis>, který obsahuje hlavičkové soubory potřebné pro sestavení externích modulů, <emphasis role="pkg">linux-firmware-image-<replaceable>verze</replaceable></emphasis>, který obsahuje soubory firmwaru potřebné některými ovladači (tento balíček může chybět, pokud sestavujete ze zdrojů jádra poskytovaných Debianem), <emphasis role="pkg">linux-image-<replaceable>verze</replaceable>-dbg</emphasis>, který obsahuje symboly debuggingu pro obraz jádra a jeho moduly a <emphasis role="pkg">linux-libc-dev</emphasis>, který obsahuje hlavičky relevantní pro některé knihovny uživatelského postoru, jako je GNU glibc.

source: The <replaceable>version</replaceable> is defined by the concatenation of the upstream version (as defined by the variables <literal>VERSION</literal>, <literal>PATCHLEVEL</literal>, <literal>SUBLEVEL</literal> and <literal>EXTRAVERSION</literal> in the <filename>Makefile</filename>), of the <literal>LOCALVERSION</literal> configuration parameter, and of the <literal>LOCALVERSION</literal> environment variable. The package version reuses the same version string with an appended revision that is regularly incremented (and stored in <filename>.version</filename>), except if you override it with the <literal>KDEB_PKGVERSION</literal> environment variable.
cs_cz: <replaceable>verze</replaceable> je definovaná zřetězením verze upstreamu (jak je definovaná proměnnými <literal>VERSION</literal>, <literal>PATCHLEVEL</literal>, <literal>SUBLEVEL</literal> a <literal>EXTRAVERSION</literal> v <filename>Makefile</filename>), konfiguračního parametru <literal>LOCALVERSION</literal> a proměnné prostředí <literal>LOCALVERSION</literal>.

source: Compiling External Modules
cs_cz: Kompilace externích modulů

source: <primary>kernel</primary><secondary>external modules</secondary>
cs_cz: <primary>jádro</primary><secondary>externí moduly</secondary>

source: <primary>modules</primary><secondary>external kernel modules</secondary>
cs_cz: <primary>moduly</primary><secondary>externí moduly jádra</secondary>

source: Some modules are maintained outside of the official Linux kernel. To use them, they must be compiled alongside the matching kernel. A number of common third party modules are provided by Debian in dedicated packages, such as <emphasis role="pkg">xtables-addons-source</emphasis> (extra modules for iptables) or <emphasis role="pkg">oss4-source</emphasis> (Open Sound System, some alternative audio drivers).
cs_cz: Některé moduly jsou zaopatřovány mimo oficiální jádro Linuxu. Aby se daly použít, musí být sestaveny zároveň s odpovídajícím jádrem. Počet
