Repository: jarabt/Hbook
Catalog: 08_basic-configuration.po
Languages: cs_cz

source: <primary>file</primary><secondary>special</secondary>
cs_cz: <primary>soubor</primary><secondary>speciální</secondary>

source: <primary>special, file</primary>
cs_cz: <primary>speciální, soubor</primary>

source: Each hardware peripheral device is represented under Unix with a special file, usually stored in the file tree under <filename>/dev/</filename> (DEVices). Two types of special files exist according to the nature of the device: “character mode” and “block mode” files, each mode allowing for only a limited number of operations. While character mode limits interaction with read/write operations, block mode also allows seeking within the available data. Finally, each special file is associated with two numbers (“major” and “minor”) that identify the device to the kernel in a unique manner. Such a file, created by the <command>mknod</command> command, simply contains a symbolic (and more human-friendly) name.
cs_cz: Každé hardwarové periferní zařízení je pod Unixem zastoupeno speciálním souborem, obvykle uloženého v souborovém stromu pod <filename>/dev/</filename> (DEVices) Existují dva typy speciálních souborů podle povahy zařízení: soubory “character mode” a “block mode”, každý mód umožňuje pouze omezený počet operací. Zatímco character mode omezuje interakci s operacemi read/write, block mode také umožňuje vyhledávání v rámci dostupných dat. A konečně, každý speciální soubor je spjatý s dvěma čísly ((“major” a “minor”), která identifikují zařízení vzhledem k jádru jedinečným způsobem. Takový soubor, vytvořený příkazem <command>mknod</command>, jednoduše obsahuje symbolické (a pro člověka zapamatovatelné) jméno.

source: The permissions of a special file map to the permissions necessary to access the device itself. Thus, a file such as <filename>/dev/mixer</filename>, representing the audio mixer, only has read/write permissions for the root user and members of the <literal>audio</literal> group. Only these users can operate the audio mixer.
cs_cz: Povolení speciálního souboru mapují povolení nezbytná pro přístup k vlastnímu zařízení. Takže, soubor, jako je <filename>/dev/mixer</filename>, reprezentující audio mixer, má pouze povolení read/write pro kořenového uživatele a uživatele skupiny <literal>audio</literal>. Pouze tito uživatelé mohou provozovat audio mixer.

source: It should be noted that the combination of <emphasis role="pkg">udev</emphasis>, <emphasis role="pkg">consolekit</emphasis> and <emphasis role="pkg">policykit</emphasis> can add additional permissions to allow users physically connected to the console (and not through the network) to access to certain devices.
cs_cz: Ještě by se mělo poznamenat, že kombinace <emphasis role="pkg">udev</emphasis>, <emphasis role="pkg">consolekit</emphasis> a <emphasis role="pkg">policykit</emphasis> může přidat doplňující povolení a umožnit tak uživatelům fyzicky připojených ke konzole (a ne prostřednictvím sítě) přístup k určitým zařízením.

source: Shell Environment
cs_cz: Prostředí shellu

source: Command interpreters (or shells) can be a user's first point of contact with the computer, and they must therefore be rather friendly. Most of them use initialization scripts that allow configuration of their behavior (automatic completion, prompt text, etc.).
cs_cz: Překladače příkazů (nebo shelly) mohou být uživatelovo první místo kontaktu s počítačem a proto musí být spíše přátelské. Většina z nich používá inicializační skripty, které umožňují nastavení jejich chování (automatické dokončování, texty výzev apod.).

source: <primary>command line interface</primary>
cs_cz: <primary>rozhraní příkazového řádku</primary>

source: <primary>command interpreter</primary>
cs_cz: <primary>příkazový překladač</primary>

source: <command>bash</command>, the standard shell, uses the <filename>/etc/bash.bashrc</filename> initialization script for “interactive” shells, and <filename>/etc/profile</filename> for “login” shells.
cs_cz: <command>bash</command>, standardní shell, používá inicializační skript <filename>/etc/bash.bashrc</filename> pro “interaktivní” shelly a <filename>/etc/profile</filename> pro “login” shelly.

source: <emphasis>BACK TO BASICS</emphasis> Login shell and (non) interactive shell
cs_cz: <emphasis>ZPĚT K ZÁKLADŮM</emphasis> Login shell a (ne) interaktivní shell

source: In simple terms, a login shell is invoked when you login to the console either locally or remotely via <command>ssh</command>, or when you run an explicit <command>bash --login</command> command. Regardless of whether it is a login shell or not, a shell can be interactive (in an <command>xterm</command>-type terminal for instance); or non-interactive (when executing a script).
cs_cz: Zjednodušeně řečeno, login shell je vyvolán, když se přihlásíte ke konzole, ať už místně nebo vzdáleně přes <command>ssh</command> nebo když spustíte explicitní příkaz <command>bash --login</command>. Ať už to je login shell či ne, shell může být interaktivní (například v terminálu typu <command>xterm</command>); nebo neinteraktivní (při spuštění skriptu).

source: <emphasis>DISCOVERY</emphasis> Other shells, other scripts
cs_cz: <emphasis>OBJEVOVÁNÍ</emphasis> Ostatní shelly, jiné skripty

source: Each command interpreter has a specific syntax and its own configuration files. Thus, <command>zsh</command> uses <filename>/etc/zshrc</filename> and <filename>/etc/zshenv</filename>; <command>csh</command> uses <filename>/etc/csh.cshrc</filename>, <filename>/etc/csh.login</filename> and <filename>/etc/csh.logout</filename>. The man pages for these programs document which files they use.
cs_cz: Každý příkazový překladač má specifický syntax a své vlastní nastavovací soubory. Takže <command>zsh</command> používá <filename>/etc/zshrc</filename> a <filename>/etc/zshenv</filename>; <command>csh</command> používá <filename>/etc/csh.cshrc</filename>, <filename>/etc/csh.login</filename> a <filename>/etc/csh.logout</filename>

source: For <command>bash</command>, it is useful to activate “automatic completion” in the <filename>/etc/bash.bashrc</filename> file (simply uncomment a few lines).
cs_cz: Pro <command>bash</command>, je užitečné aktivovat “automatické dokončování” v souboru <filename>/etc/bash.bashrc</filename> (jednoduše odkomentováním několika málo řádků).

source: <emphasis>BACK TO BASICS</emphasis> Automatic completion
cs_cz: <emphasis>ZPĚT K ZÁKLADŮM</emphasis> Automatické dokončování

source: <primary>automatic completion</primary>
cs_cz: <primary>automatické dokončování</primary>

source: Many command interpreters provide a completion feature, which allows the shell to automatically complete a partially typed command name or argument when the user hits the <keycap>Tab</keycap> key. This lets users work more efficiently and be less error-prone.
cs_cz: Mnoho příkazových překladačů poskytuje dokončovací funkcionalitu, která umožňuje shellu automaticky kompletovat částečně zadaná příkazová jména nebo argumenty, jakmile uživatel stiskne klávesu <keycap>Tab</keycap>. To umožňuje uživatelům pracovat efektivněji a bezchybněji.

source: This function is very powerful and flexible. It is possible to configure its behavior according to each command. Thus, the first argument following <command>apt-get</command> will be proposed according to the syntax of this command, even if it does not match any file (in this case, the possible choices are <literal>install</literal>, <literal>remove</literal>, <literal>upgrade</literal>, etc.).
cs_cz: Tato funkce je velmi výkonná a flexibilní. Je možné nastavit její chování vzhledem ke každému příkazu. Takže, první argument následující po <command>apt-get</command> bude navrhnut vzhledem k syntaxi tohoto příkazu, i když nevyhovuje žádnému souboru (v tomto případě jsou možné volby <literal>install</literal>, <literal>remove</literal>, <literal>upgrade</literal> apod.).

source: <emphasis>BACK TO BASICS</emphasis> The tilde, a shortcut to HOME
cs_cz: <emphasis>BACK TO BASICS</emphasis> Vlnovka, zkratka k HOME

source: The tilde is often used to indicate the directory to which the environment variable, <varname>HOME</varname>, points (being the user's home directory, such as <filename>/home/rhertzog/</filename>). Command interpreters automatically make the substitution: <filename>~/hello.txt</filename> becomes <filename>/home/rhertzog/hello.txt</filename>.
cs_cz: Vlnovka je často používaná k označení adresáře, kam ukazuje proměnná prostředí <varname>HOME</varname> (což je uživatelův domovský adresář, jako je <filename>/home/rhertzog/</filename>). Příkazové překladače automaticky provedou náhradu: <filename>~/hello.txt</filename> se stane <filename>/home/rhertzog/hello.txt</filename>.

source: The tilde also allows access to another user's home directory. Thus, <filename>~rmas/bonjour.txt</filename> is synonymous with <filename>/home/rmas/bonjour.txt</filename>.
cs_cz: Vlnovka také umožní přístup k ostatním uživatelovým domovským adresářům. Takže, <filename>~rmas/bonjour.txt</filename> je synonymum pro <filename>/home/rmas/bonjour.txt</filename>.

source: In addition to these common scripts, each user can create their own <filename>~/.bashrc</filename> and <filename>~/.bash_profile</filename> to configure their shell. The most common changes are the addition of aliases; these are words that are automatically replaced with the execution of a command, which makes it faster to invoke that command. For instance, you could create the <literal>la</literal> alias for the command <command>ls -la | less</command> command; then you only have to type <command>la</command> to inspect the contents of a directory in detail.
cs_cz: K těmto běžným skriptům si může uživatel vytvořit své vlastní <filename>~/.bashrc</filename> a <filename>~/.bash_profile</filename> k nastavení svého shellu. Nejběžnějšími změnami je přidání aliasů; to jsou slova, která jsou automaticky nahrazena spuštěním příkazu, což urychluje jeho vyvolání. Například můžete vytvořit alias <literal>la</literal> pro příkaz <command>ls -la | less</command>; potom musíte pouze napsat <command>la</command> za účelem detailního prohlédnutí si obsahu adresáře.

source: <emphasis>BACK TO BASICS</emphasis> Environment variables
cs_cz: <emphasis>ZPĚT K ZÁKLADŮM</emphasis> proměnné prostředí

source: <primary>environment</primary><secondary>environment variable</secondary>
cs_cz: <primary>prostředí</primary><secondary>proměnná prostředí</secondary>

source: <primary>variable, environment</primary>
cs_cz: <primary>proměnná, prostředí</primary>

source: Environment variables allow storage of global settings for the shell or various other programs called. They are contextual (each process has its own set of environment variables) but inheritable. This last characteristic offers the possibility for a login shell to declare variables which will be passed down to all programs it executes.
cs_cz: Proměnné prostředí umožňují uložení globálních nastavení shellu nebo různých jiných programů, co se volají. Jsou kontextové (každý proces má svoji vlastní sadu proměnných prostředí), ale dědičné. Tato poslední charakteristika nabízí možnost pro login shell deklarovat proměnné, které budou předány všem programům, které spouští.

source: Setting default environment variables is an important element of shell configuration. Leaving aside the variables specific to a shell, it is preferable to place them in the <filename>/etc/environment</filename> file, since it is used by the various programs likely to initiate a shell session. Variables typically defined there include <varname>ORGANIZATION</varname>, which usually contains the name of the company or organization, and <varname>HTTP_PROXY</varname>, which indicates the existence and location of an HTTP proxy.
cs_cz: Nastavování přednastavených proměnných prostředí je důležitý prvek nastavení shellu. Pokud necháme stranou proměnné specifické pro shell, upřdnostňuje se je umístit do souboru <filename>/etc/environment</filename>, protože ten se používá různými programy majícími v úmyslu nastartovat nějaký proces na shellu. Mezi proměnné, které se tu typicky definují patří <varname>ORGANIZATION</varname>, která obyčejně obsahuje jméno firmy nebo organizace a <varname>HTTP_PROXY</varname>, která označuje přítomnost a umístění HTTP proxy serveru.

source: <emphasis>TIP</emphasis> All shells configured identically
cs_cz: <emphasis>TIP</emphasis> Všechny shelly jsou nakonfigurovány identicky

source: Users often want to configure their login and interactive shells in the same way. To do this, they choose to interpret (or “source”) the content from <filename>~/.bashrc</filename> in the <filename>~/.bash_profile</filename> file. It is possible to do the same with files common to all users (by calling <filename>/etc/bash.bashrc</filename> from <filename>/etc/profile</filename>).
cs_cz: Uživatelé často chtějí nastavit své přihlašovací a interaktivní shelly stejným způsobem. Aby tak učinili, zvolí přeložení (nebo “nasátí”) obsahu <filename>~/.bashrc</filename> v souboru <filename>~/.bash_profile</filename>. To samé je možné učinit se soubory společnými pro všechny uživatele (zavoláním <filename>/etc/bash.bashrc</filename> ze <filename>/etc/profile</filename>).

source: Printer Configuration
cs_cz: Nastavení tiskárny

source: <primary>configuration</primary><secondary>printing</secondary>
cs_cz: <primary>nastevení</primary><secondary>tisk</secondary>

source: <primary>printing</primary><secondary>configuration</secondary>
cs_cz: <primary>tisk</primary><secondary>nastevení</secondary>

source: Printer configuration used to cause a great many headaches for administrators and users alike. These headaches are now mostly a thing of the past, thanks to <emphasis role="pkg">cups</emphasis>, the free print server using the IPP protocol (Internet Printing Protocol).
cs_cz: Nastevení tiskárny obyčejně způsobovalo opravdu hodně trápení jak administrátorům, tak uživatelům. Tyto bolehlavy již většinou patří do historie díky <emphasis role="pkg">cups</emphasis>, svobodnému tiskovému serveru používajícího protokol IPP (Internet Printing Protocol).

source: This program is divided over several Debian packages: <emphasis role="pkg">cups</emphasis> is the central print server; <emphasis role="pkg">cups-bsd</emphasis> is a compatibility layer allowing use of commands from the traditional BSD printing system (<command>lpd</command> daemon, <command>lpr</command> and <command>lpq</command> commands, etc.); <emphasis role="pkg">cups-client</emphasis> contains a group of programs to interact with the server (block or unblock a printer, view or delete print jobs in progress, etc.); and finally, <emphasis role="pkg">cups-driver-gutenprint</emphasis> contains a collection of additional printer drivers for <command>cups</command>.
cs_cz: Tento program je rozdělen do několika balíčků Debianu: <emphasis role="pkg">cups</emphasis> je ústřední tiskový server; <emphasis role="pkg">cups-bsd</emphasis> je vrstva kompatibility umožňující použití příkazů z tradičního BSD tiskového systmému (démon <command>lpd</command>, příkazy <command>lpr</command> a <command>lpq</command> atd.); <emphasis role="pkg">cups-client</emphasis> obsahuje skupinu programů pro vzájemnou komunikaci se serverem (blokování nebo odblokování tiskárny, zobrazení nebo vymazání běžící tiskové úlohy apod.);

source: <emphasis>COMMUNITY</emphasis> CUPS
cs_cz: <emphasis>KOMUNITA</emphasis> CUPS

source: <primary>Common Unix Printing System</primary>
cs_cz: <primary>Společný Unixový systém tisku</primary>

source: CUPS (Common Unix Printing System) is a project (and a trademark) managed by Apple, Inc. <ulink type="block" url="http://www.cups.org/" />
cs_cz: CUPS (Common Unix Printing System) je projekt (a ochranná známka) spravovaná firmou Apple, Inc. <ulink type="block" url="http://www.cups.org/" />

source: After installation of these different packages, <command>cups</command> is administered easily through a web interface accessible at the local address: <literal>http://localhost:631/</literal>. There you can add printers (including network printers), remove, and administer them. You can also administer <command>cups</command> with the graphical interface provided by the desktop environment. Finally, there is also the <command>system-config-printer</command> graphical interface (from the Debian package of the same name).
cs_cz: Po instalaci těchto odlišných balíčků je <command>cups</command> snadno řízen prostřednictvím webového rozhraní dostupného na lokální adrese: <literal>http://localhost:631/</literal>. Zde můžete přidat tiskárny (včetně síťových tiskáren), odstranit je a administrovat. <command>cups</command> můžete spravovat pomocí grafického rozhraní poskytovaného desktopovým prostředím. A konečně, je tu také grafické prostředí <command>system-config-printer</command> (z balíčku Debianu toho samého jména).

source: <primary><command>cups</command></primary><secondary>administration</secondary>
cs_cz: <primary><command>cups</command></primary><secondary>administrace</secondary>

source: <emphasis>NOTE</emphasis> Obsolescence of <filename>/etc/printcap</filename>
cs_cz: <emphasis>POZNÁMKA</emphasis> Zastaralost <filename>/etc/printcap</filename>

source: <emphasis>cups</emphasis> no longer uses the <filename>/etc/printcap</filename> file, which is now obsolete. Programs that rely upon this file to get a list of available printers will, thus, fail. To avoid this problem, delete this file and make it a symbolic link (see sidebar <xref linkend="sidebar.symbolic-link" />) to <filename>/var/run/cups/printcap</filename>, which is maintained by <emphasis>cups</emphasis> to ensure compatibility.
cs_cz: <emphasis>cups</emphasis> již nepoužívá soubor <filename>/etc/printcap</filename>, který je nyní zastaralý. Programy, které spoléhají na tento soubor při obstarávání si seznamu dostupných tiskáren, tak, selhávají. Aby jste předešli tomuto problému, smažte tento soubor a udělejte jej symbolickým odkazem (viz. poznámka na boku <xref linkend="sidebar.symbolic-link" />) na <filename>/var/run/cups/printcap</filename>, který je spravován systémem <emphasis>cups</emphasis> pro zaručení kompatability.

source: Configuring the Bootloader
cs_cz: Nastavení bootloaderu

source: It is probably already functional, but it is always good to know how to configure and install the bootloader in case it disappears from the Master Boot Record. This can occur after installation of another operating system, such as Windows. The following information can also help you to modify the bootloader configuration if needed.
cs_cz: Je pravděpodobně již funkční, ale je vždy dobré vědět, jak nastavit a nainstalovat bootloader v případě, že zmizí z hlavního bootovacího záznamu. To se může stát po instalaci jiného operačního systmému, jako jsou Windows. Následující informace vám také pomohou změnit nastavení bootloaderu, pokud bude třeba.

source: <emphasis>BACK TO BASICS</emphasis> Master boot record
cs_cz: <emphasis>ZPĚT K ZÁKLADŮM</emphasis> Hlavní bootovací záznam

source: <primary>Master Boot Record</primary>
cs_cz: <primary>Hlavní bootovací záznam</primary>

source: The Master Boot Record (MBR) occupies the first 512 bytes of the first hard disk, and is the first thing loaded by the BIOS to hand over control to a program capable of booting the desired operating system. In general, a bootloader gets installed in the MBR, removing its previous content.
cs_cz: Hlavní bootovací záznam (MBR, The Master Boot Record) zabírá prvních 512 bajtů prvního pevného disku a je první věcí, kterou nahraje BIOS za účelem převzetí kontroly programem schopným bootování kýženého operačního systému. Dá se tedy říci, že bootloader je nainstalovaný do MBR, zároveň za odstranění svého předcházejícího obsahu.

source: Identifying the Disks
cs_cz: Identifikace disků

source: <emphasis>CULTURE</emphasis> <emphasis>udev</emphasis> and <filename>/dev/</filename>
cs_cz: <emphasis>KULTURA</emphasis> <emphasis>udev</emphasis> a <filename>/dev/</filename>

source: The <filename>/dev/</filename> directory traditionally houses so-called “special” files, intended to represent system peripherals (see sidebar <xref linkend="sidebar.special-files" />). Once upon a time, it used to contain all special files that could potentially be used. This approach had a number of drawbacks among which the fact that it restricted the number of devices that one could use (due to the hardcoded list of names), and that it was impossible to know which special files were actually useful.
cs_cz: Adresář <filename>/dev/</filename> tradičně hostí takzvané “speciální” soubory, které mají na starosti symbolizovat periferní zařízení (viz. poznámka na boku <xref linkend="sidebar.special-files" />). Kdysi za starých časů obsahoval všechny speciální soubory, které mohly být potenciálně použity. Tento přístup měl ovšem několik nevýhod mezi které patřil fakt, že omezoval počet zařízení, která by mohla být použita (kvůli napevno kódovanému seznamu jmen) a že bylo nemožné zjistit, které speciální soubory byly doopravdy užitečné.

source: Nowadays, the management of special files is entirely dynamic and matches better the nature of hot-swappable computer devices. The kernel cooperates with <emphasis>udev</emphasis> to create and delete them as needed when the corresponding devices appear and disappear. For this reason, <filename>/dev/</filename> doesn't need to be persistent and is thus a RAM-based filesystem that starts empty and contains only the relevant entries.
cs_cz: V součastnosti je řízení speciálních souborů kompletně dynamické a lépe odpovídá povaze rychle vyměnitelným počítačovým zařízením. Jádro spolupracuje s <emphasis>udev</emphasis> kvůli jejich vytvoření a vymazání podle potřeby, když se odpovídající zařízaní objeví a zmizí. Z tohoto důvodu <filename>/dev/</filename> nemusí být trvalý a je tak souborovým systémem založeným na RAM, který začíná prázdný a obsahuje pouze relevantní záznamy.

source: The kernel communicates lots of information about any newly added device and hands out a pair of major/minor numbers to identify it. With this <command>udevd</command> can create the special file under the name and with the permissions that it wants. It can also create aliases and perform additional actions (such as initialization or registration tasks). <command>udevd</command>'s behavior is driven by a large set of (customizable) rules.
cs_cz: Jádro komunikuje se spoustou informací o nově přidaném zařízení a předává dvojici major/minor čísel pro jeho identifikaci. S tímto je <command>udevd</command> schopen vytvořit speciální soubor pod jménem a s povoleními jaké chce. Může také vytvořit aliasy a provést další akce (jako jsou inicializační a registrační úkoly). Chování <command>udevd</command> je řízeno obsáhlou sadou (uzpůsobitelných) pravidel.

source: With dynamically assigned names, you can thus keep the same name for a given device, regardless of the connector used or the connection order, which is especially useful when you use various USB peripherals. The first partition on the first hard drive can then be called <filename>/dev/sda1</filename> for backwards compatibility, or <filename>/dev/root-partition</filename> if you prefer, or even both at the same time since <command>udevd</command> can be configured to automatically create a symbolic link.
cs_cz: S dynamicky přiřazenými jmény si tak můžete ponechat ta samá jkména pro daná zařízení, nehledě na použitý konektor nebo pořadí zapojení, což je zvláště užizečné, pokud používáte různá USB periferní zařízaní. První oddíl na prvním pevném disku tak může být nazýván <filename>/dev/sda1</filename> kvůli zpětné kompatabilitě nebo <filename>/dev/root-partition</filename> pokud toto preferujete nebo klidně oběma jmény najednou, protože <command>udevd</command> může být nastaven k tomu, aby automaticky vytvořil symbolický odkaz.
