Repository: jarabt/Hbook
Catalog: 08_basic-configuration.po
Languages: cs_cz

source: Configuration
cs_cz: Nastavení

source: Localization
cs_cz: Lokalizace

source: Locales
cs_cz: Umístění

source: Network
cs_cz: Síť

source: Name resolution
cs_cz: Rozlišení jména

source: Users
cs_cz: Uživatelé

source: Groups
cs_cz: Skupiny

source: Accounts
cs_cz: Účty

source: Command-line interpreter
cs_cz: Interpret příkazové řádky

source: Printing
cs_cz: Tisk

source: Kernel compiling
cs_cz: Sestavení jádra

source: Basic Configuration: Network, Accounts, Printing...
cs_cz: Základní nastavení: Síť, účty, tisk...

source: A computer with a new installation created with <command>debian-installer</command> is intended to be as functional as possible, but many services still have to be configured. Furthermore, it is always good to know how to change certain configuration elements defined during the initial installation process.
cs_cz: Počítač s novou instalací vytvořenou <command>debian-installer</command> je zamýšlená, aby byla tak funkční, jak je to jen možné, ale mnoho služeb stále musí být nastaveno. Navíc, je vždy dobré vědět, jak změnit určité nastavovací prvky definované během počátečního instalačního procesu.

source: This chapter reviews everything included in what we could call the “basic configuration”: networking, language and locales, users and groups, printing, mount points, etc.
cs_cz: Tato kapitola shrne vše, co je zahrnuto v něčem, čemu můžeme říkat “základní nastavení”: sítě, jazyk a umístění, uživatelé a skupiny, tisk, přípojné body apod.

source: Configuring the System for Another Language
cs_cz: Nastavení systému pro jiný jazyk

source: <primary>French localization</primary>
cs_cz: <primary>Francouzská lokalizace</primary>

source: If the system was installed using French, the machine will probably already have French set as the default language. But it is good to know what the installer does to set the language, so that later, if the need arises, you can change it.
cs_cz: Pokud byl systém nainstalován za použití francouzštiny, zařízení bude již pravděpodobně mít francouzštinu zvolen jako přednastavený jazyk. Je ale dobré vědět, co instalátor udělá k tomu, aby nastavil jazyk, takže později, pokud nastane potřeba, jej můžete změnit.

source: <emphasis>TOOL</emphasis> The <command>locale</command> command to display the current configuration
cs_cz: <emphasis>NÁSTROJ</emphasis> příkaz <command>locale</command> ke zobrazení současné konfigurace

source: The <command>locale</command> command lists a summary of the current configuration of various locale parameters (date format, numbers format, etc.), presented in the form of a group of standard environment variables dedicated to the dynamic modification of these settings.
cs_cz: Příkaz <command>locale</command> vypíše shrnutí současného nastavení co do různých lokálních parametrů (formát data, formát čísel apod.), prezentované formou skupin standardních proměnných prostředí věnovanou dynamické modifikaci těchto nastavení.

source: Setting the Default Language
cs_cz: Nastavení přednastaveného jazyka

source: <primary>locales</primary>
cs_cz: <primary>umístění</primary>

source: <primary>language</primary>
cs_cz: <primary>jazyk</primary>

source: A locale is a group of regional settings. This includes not only the language for text, but also the format for displaying numbers, dates, times, and monetary sums, as well as the alphabetical comparison rules (to properly account for accented characters). Although each of these parameters can be specified independently from the others, we generally use a locale, which is a coherent set of values for these parameters corresponding to a “region” in the broadest sense. These locales are usually indicated under the form, <literal><replaceable>language-code</replaceable>_<replaceable>COUNTRY-CODE</replaceable></literal>, sometimes with a suffix to specify the character set and encoding to be used. This enables consideration of idiomatic or typographical differences between different regions with a common language.
cs_cz: Locale je skupina regionálních nastavení. Neobsahuje pouze jazyk textu, ale také formát pro zobrazení čísel, dat, času a peněžních částek, stejně jako pravidel abecedního porovnávání (pro správné posuzování přízvučných znaků). Přes to, že by každý z těchto parametrů mohly být upřesňován nezávisle na ostatních, používáme locale, který je ucelenou sadou hodnot těchto parametrů odpovídajícího “regionu” v nejširším slova smyslu. Umístění jsou většinou indikována formou <literal><replaceable>jazyk-kód</replaceable>_<replaceable>ZEMĚ-KÓD</replaceable></literal>, někdy s příponou popisující sadu znaků a kódování, které se použije. Tím se umožní posouzení idiomatických nebo typografických rozdílů mezi rozdílnými regiony se společným jazykem.

source: <emphasis>CULTURE</emphasis> Character sets
cs_cz: <emphasis>KULTURA</emphasis> Sada znaků

source: <primary>character set</primary>
cs_cz: <primary>sada znaků</primary>

source: <primary>encoding</primary>
cs_cz: <primary>kódování</primary>

source: Historically, each locale has an associated “character set” (group of known characters) and a preferred “encoding” (internal representation for characters within the computer).
cs_cz: Historicky, každé umístění je spojeno se “znakovou sadou” (skupinou známých znaků) a preferovaným “kódováním” (interní reprezentací znaků v rámci počítače).

source: The most popular encodings for latin-based languages were limited to 256 characters because they opted to use a single byte for each character. Since 256 characters was not enough to cover all European languages, multiple encodings were needed, and that is how we ended up with <emphasis>ISO-8859-1</emphasis> (also known as “Latin 1”) up to <emphasis>ISO-8859-15</emphasis> (also known as “Latin 9”), among others.
cs_cz: Nejznámějším kódováním pro jazyky se základem v latině je omezeno na 256 znaků, protože se zvolilo používání jednoho bytu pro každý znak. Protože 256 znaků nebylo dostatečných pro pokrytí všech evropských jazyků, několikanásobné kódování bylo nutné a to je důvod, proč jsme skončili s <emphasis>ISO-8859-1</emphasis> (také známého jako “Latin 1”) až po <emphasis>ISO-8859-15</emphasis> (také známého jako “Latin 9”), mezi jinými.

source: Working with foreign languages often implied regular switches between various encodings and character sets. Furthermore, writing multilingual documents led to further, almost intractable problems. Unicode (a super-catalog of nearly all writing systems from all of the world's languages) was created to work around this problem. One of Unicode's encodings, UTF-8, retains all 128 ASCII symbols (7-bit codes), but handles other characters differently. Those are preceded by a specific escape sequence of a few bits, which implicitly defines the length of the character. This allows encoding all Unicode characters on a sequence of one or more bytes. Its use has been popularized by the fact that it is the default encoding in XML documents.
cs_cz: Práce s cizími jazyky často znamenala časté přepínání mezi různými kódováními a znakovými sadami. Navíc, psaní vícejazyčných dokumentů vedlo k dalším, téměř neřešitelným problémům. Unicode (super výčet téměř všech systémů psaní ze všech světových jazyků) byl vytvořen proto, abychom se tomuto problému vyhnuli. Jedno z kódování Unicode, UTF-8, ponechává si všech 128 ASCII symbolů (7 bitové kódy), ale ostatní znaky řeší jinak. Těm předchází zvláštní úniková sekvence pár bitů, která implicitně definuje délku znaku. To umožňuje kódování všech znaků Unicode sekvencí jednoho nebo více bajtů. Jeho užívání bylo zpopularizováno faktem, že je to přednastavené kódovaní dokumentů XML.

source: This is the encoding that should generally be used, and is thus the default on Debian systems.
cs_cz: Toto je kódování, které by mělo být všeobecně použito a je tedy přednastaveno na systémech Debian.

source: The <emphasis role="pkg">locales</emphasis> package includes all the elements required for proper functioning of “localization” of various applications. During installation, this package will ask to select a set of supported languages. This set can be changed at any time by running <command>dpkg-reconfigure locales</command> as root.
cs_cz: Balíček <emphasis role="pkg">locales</emphasis> zahrnuje všechny prvky potřebné pro správné fungování “lokalizace” různých aplikací. Během instalace tento balíček požádá o výběr sady podporovaných jazyků. Tato sada může být kdykoli změněna spuštěním <command>dpkg-reconfigure locales</command> coby root.

source: The first question invites you to select “locales” to support. Selecting all English locales (meaning those beginning with “<literal>en_</literal>”) is a reasonable choice. Do not hesitate to also enable other locales if the machine will host foreign users. The list of locales enabled on the system is stored in the <filename>/etc/locale.gen</filename> file. It is possible to edit this file by hand, but you should run <command>locale-gen</command> after any modifications. It will generate the necessary files for the added locales to work, and remove any obsolete files.
cs_cz: První dotaz vás vyzve k vývěru podporovaných “umístění”. Výběrem všech anglických umístění (to znamená těch, která začínají na “<literal>en_</literal>”) je rozumnou volbou. Neváhejte také vybrat další jazyky, pokud bude zařízení v užívání zahraničních uživatelů. Seznam povolených umístění v systému je uložen v souboru <filename>/etc/locale.gen</filename>. Je možné tento soubor editovat ručně, ale raději by jste měli spustit <command>locale-gen</command> při jakékoli modifikaci. To vygeneruje nezbytné soubory pro přidání umístění do provozu a odstraní zastaralé soubory.

source: The second question, entitled “Default locale for the system environment”, requests a default locale. The recommended choice in the U.S.A. is “<literal>en_US.UTF-8</literal>”. British English speakers will prefer “<literal>en_GB.UTF-8</literal>”, and Canadians will prefer either “<literal>en_CA.UTF-8</literal>” or, for French, “<literal>fr_CA.UTF-8</literal>”. The <filename>/etc/default/locale</filename> file will then be modified to store this choice. From there, it is picked up by all user sessions since PAM will inject its content in the <varname>LANG</varname> environment variable.
cs_cz: Druhá otázka, s názvem “Přednatavené umístění pro systémové prostředí”, vyžaduje přednastavené umístění. Doporučená volba pro U.S.A je “<literal>en_US.UTF-8</literal>”. Ti, co hovoří britskou angličtinou budou preferovat “<literal>en_GB.UTF-8</literal>” a Kanaďané budou preferovat buď “<literal>en_CA.UTF-8</literal>” nebo pro francouzšinu “<literal>fr_CA.UTF-8</literal>”. Soubor <filename>/etc/default/locale</filename> bude potom modifikován podle vaší volby. Odtud je vybírána pro všechna uživatelská přihlášení, protože PAM vnese svůj obsah do proměnné prostředí <varname>LANG</varname>.

source: <primary>environment</primary>
cs_cz: <primary>prostředí</primary>

source: <primary>locale</primary>
cs_cz: <primary>umístění</primary>

source: <emphasis>BEHIND THE SCENES</emphasis> <filename>/etc/environment</filename> and <filename>/etc/default/locale</filename>
cs_cz: <emphasis>ZA SCÉNOU</emphasis> <filename>/etc/environment</filename> a <filename>/etc/default/locale</filename>

source: The <filename>/etc/environment</filename> file provides the <command>login</command>, <command>gdm</command>, or even <command>ssh</command> programs with the correct environment variables to be created.
cs_cz: Soubor <filename>/etc/environment</filename> zajišťuje programům <command>login</command>, <command>gdm</command>, nebo také <command>ssh</command> vytvoření správných proměnných prosředí.

source: These applications do not create these variables directly, but rather via a PAM (<filename>pam_env.so</filename>) module. PAM (Pluggable Authentication Module) is a modular library centralizing the mechanisms for authentication, session initialization, and password management. See <xref linkend="sect.config-pam" /> for an example of PAM configuration.
cs_cz: Tyto aplikace přímo nevytvářejí tyto proměnné, ale spíše prosřednictvím modulu (<filename>pam_env.so</filename>). PAM (Pluggable Authentication Module) je modulová knihovna, která centralizuje mechanismus autentifikace, inicializaci spojení a správu hesla. Příklad nastavení PAM naleznete zde <xref linkend="sect.config-pam" />.

source: The <filename>/etc/default/locale</filename> file works in a similar manner, but contains only the <varname>LANG</varname> environment variable. Thanks to this split, some PAM users can inherit a complete environment without localization. Indeed, it is generally discouraged to run server programs with localization enabled; on the other hand, localization and regional settings are recommended for programs that open user sessions.
cs_cz: Soubor <filename>/etc/default/locale</filename> pracuje podobným způsobem, ale obsahuje pouze proměnnou prostředí <varname>LANG</varname>. Díky tomuto rozdělení, mohou někteří uživatelé dědit kompletní prostředí bez lokalizace. Samozřejmě, všeobecně se nedoporučuje spouštět programy serveru se zapnutou lokalizací; na druhou stranu, lokalizace a regionální nastavení jsou doporučené pro programy, které otevírají spojení uživatele.

source: Configuring the Keyboard
cs_cz: Nastavení klávesnice

source: <primary>keyboard layout</primary>
cs_cz: <primary>rozvržení klávesnice</primary>

source: <primary>layout, keyboard</primary>
cs_cz: <primary>rozvržení, klávesnice</primary>

source: Even if the keyboard layout is managed differently in console and graphical mode, Debian offers a single configuration interface that works for both: it is based on debconf and is implemented in the <emphasis role="pkg">keyboard-configuration</emphasis> package. Thus the <command>dpkg-reconfigure keyboard-configuration</command> command can be used at any time to reset the keyboard layout.
cs_cz: I když je rozvržení klávesnice spravováno rozdílně na konzole a grafickém módu, Debian nabízí jednotné nastavovací rozhraní, které funguje pro obě: je založeno na programu debconf a je implementováno v balíčku <emphasis role="pkg">keyboard-configuration</emphasis>. Takže příkaz <command>dpkg-reconfigure keyboard-configuration</command> se může použít kdykoliv k přenastavení klávesnicového rozložení.

source: <indexterm><primary><literal>azerty</literal></primary></indexterm>The questions are relevant to the physical keyboard layout (a standard PC keyboard in the US will be a “Generic 104 key”), then the layout to choose (generally “US”), and then the position of the AltGr key (right Alt). Finally comes the question of the key to use for the “Compose key”, which allows for entering special characters by combining keystrokes. Type successively <keycombo action="seq"><keycap>Compose</keycap><keycap>'</keycap><keycap>e</keycap></keycombo> and produce an e-acute (“é”). All these combinations are described in the <filename>/usr/share/X11/locale/en_US.UTF-8/Compose</filename> file (or another file, determined according to the current locale indicated by <filename>/usr/share/X11/locale/compose.dir</filename>).
cs_cz: <indexterm><primary><literal>azerty</literal></primary></indexterm>Dotazy jsou relevantní pro fyzické rozložení klávesnice (standardní klávesnice PC v USA bude “Generic 104 key”), potom se vybere rozložení (obvykle “US”) a potom pozice klávesy AltGr (pravý Alt). Potom dojde na dotaz ohledně klávesy, která se používá pro “Compose key”, která umožňuje zadání speciálních znaků kombinací stisků kláves. Zadejte postupně <keycombo action="seq"><keycap>Compose</keycap><keycap>'</keycap><keycap>e</keycap></keycombo> a vytvořte dlouhé e (“é”). Veškeré tyto kombinace jsou popsány v souboru <filename>/usr/share/X11/locale/en_US.UTF-8/Compose</filename> (nebo jiném souboru, určeného podle současného umístění indikovaného <filename>/usr/share/X11/locale/compose.dir</filename>).

source: <primary><literal>Compose</literal>, key</primary>
cs_cz: <primary><literal>Compose</literal> klávesa</primary>

source: <primary><literal>Meta</literal>, key</primary>
cs_cz: <primary><literal>Meta</literal> klávesa</primary>

source: <primary>key</primary><secondary><literal>Meta</literal></secondary>
cs_cz: <primary>klávesa</primary><secondary><literal>Meta</literal></secondary>

source: <primary>key</primary><secondary><literal>Compose</literal></secondary>
cs_cz: <primary>klávesa</primary><secondary><literal>Compose</literal></secondary>

source: Note that the keyboard configuration for graphical mode described here only affects the default layout; the GNOME and KDE environments, among others, provide a keyboard control panel in their preferences allowing each user to have their own configuration. Some additional options regarding the behavior of some particular keys are also available in these control panels.
cs_cz: Uvědomte si, že nastavení klávesnice pro grafický mód, které je zde popsané, ovlivňuje pouze přednastavené rozložení; prostředí GNOME a KDE, stejně jako jiné, poskytují kontrolní panel ve svých preferencích, umožňující každému uživateli mít svoje vlastní nastavení. Na těchto kontrolních panelech jsou také k dispozici některé další možnosti ohledně chování některých konkrétních kláves.

source: Migrating to UTF-8
cs_cz: Přechod na UTF-8

source: The generalization of UTF-8 encoding has been a long awaited solution to numerous difficulties with interoperability, since it facilitates international exchange and removes the arbitrary limits on characters that can be used in a document. The one drawback is that it had to go through a rather difficult transition phase. Since it could not be completely transparent (that is, it could not happen at the same time all over the world), two conversion operations were required: one on file contents, and the other on filenames. Fortunately, the bulk of this migration has been completed and we discuss it largely for reference.
cs_cz: Generalizace kódování UTF-8 byla dlouho očekávaným řešením pro mnoho obtíží s interoperabilitou, protože usnadňuje mezinárodní výměnu a odstraňuje různá omezení u znaků, které mohou být v dokumentech použity. Stinnou stránkou je, že musela projít do jisté míry obtížnou přechodovou fází. Protože nemohla být úplně transparentní (což je, že se nemohla udát v jeden časový okamžik na celém světě), byly zapotřebí dvě převodové operace: jedna na obsahu souborů a jedna na jménech souborů. Naštěstí, podstatná část tohoto přechodu byla dokončena a zde ji uvádíme jen pro úplnost.

source: <emphasis>CULTURE</emphasis> <foreignphrase>Mojibake</foreignphrase> and interpretation errors
cs_cz: <emphasis>KULTURA</emphasis> <foreignphrase>Mojibake</foreignphrase> a interpretační chyby

source: When a text is sent (or stored) without encoding information, it is not always possible for the recipient to know with certainty what convention to use for determining the meaning of a set of bytes. You can usually get an idea by getting statistics on the distribution of values present in the text, but that doesn't always give a definite answer. When the encoding system chosen for reading differs from that used in writing the file, the bytes are mis-interpreted, and you get, at best, errors on some characters, or, at worst, something completely illegible.
cs_cz: Pokud je text poslán (nebo uložen) bez informacích o kódování, není vždy pro příjemnce možné s určitostí zjistit, jakou konvenci použít pro určení smyslu souboru bajtů. Obyčejně se můžete, na základě obdržených statistik o rozložení hodnot přítomných v textu, domnívat, to vám ale vždy nedá definitivní odpověď. Pokud se systém kódování pro čtení liší od toho, co se použil na psaní souboru, jsou bajty špatně interpretovány a v nejlepším případě se vám objeví chyby na některých znacích nebo, v tom nejhorším, něco úplně nečitelné.

source: Thus, if a French text appears normal with the exception of accented letters and certain symbols which appear to be replaced with sequences of characters like “Ã©” or Ã¨” or “Ã§”, it is probably a file encoded as UTF-8 but interpreted as ISO-8859-1 or ISO-8859-15. This is a sign of a local installation that has not yet been migrated to UTF-8. If, instead, you see question marks instead of accented letters — even if these question marks seem to also replace a character that should have followed the accented letter — it is likely that your installation is already configured for UTF-8 and that you have been sent a document encoded in Western ISO.
cs_cz: Takže, pokud francouzský text vypadá normálně, kromě písmen s diakritikou a určitých symbolů, kde se zdá, že se zobrazily nahrazené posloupností znaků jako “Ã©” nebo Ã¨” nebo “Ã§”, je asi pravděpodobně soubor kódován jako UTF-8, ale interpretován jako ISO-8859-1 nebo ISO-8859-15. To je známka lokální instalace, která ještě nepřešla na UTF-8. Pokud, namísto toho, vidíte otazníky místo písmen s diakritikou — i když se zdá, že tyto otazníky také nahradily znak, který by měl následovat písmeno s diakritikou — pravděpodobně je vaše instalace již nastavena na UTF-8 a dokument, který vám byl poslán, je kódován ve Western ISO.

source: So much for “simple” cases. These cases only appear in Western culture, since Unicode (and UTF-8) was designed to maximize the common points with historical encodings for Western languages based on the Latin alphabet, which allows recognition of parts of the text even when some characters are missing.
cs_cz: Tolik k “jednoduchým” případům. Tyto případy se objevují pouze v západní kultuře, protože Unicode (a UTF-8) byl vytvořen pro maximalizaci společných bodů s historickými kódováními pro západní jazyky, založenými na latince, který dovoluje rozeznávání částí textu, i když některé znaky chybí.

source: In more complex configurations, which, for example, involve two environments corresponding to two different languages that do not use the same alphabet, you often get completely illegible results — a series of abstract symbols that have nothing to do with each other. This is especially common with Asian languages due to their numerous languages and writing systems. The Japanese word <foreignphrase>mojibake</foreignphrase> has been adopted to describe this phenomenon. When it appears, diagnosis is more complex and the simplest solution is often to simply migrate to UTF-8 on both sides.
cs_cz: V komplexnějších nastaveních, která, například, zahrnují dvě prostředí odpovídající dvěma rozdílným jazykům, co nepoužívají stejnou abecedu, obdržíte často něco absolutně nečitelného — sérii abstraktních symbolů, které spolu vůbec nesouvisejí. To je speciálně případ asijských jazyků z důvodu počtu svých jazyků a systémů psaní. Japonské slovo <foreignphrase>mojibake</foreignphrase> bylo převzato k popisu tohoto úkazu. Pokud toto nastane, je rozpoznání příčin komplexnější a nejjednodušším řešením je často pouhá migrace na UTF-8 na obou stranách.
