Repository: jarabt/Hbook
Catalog: 08_basic-configuration.po
Languages: cs_cz

source: For this purpose, it is enough to use the <command>vipw</command> command to edit the <filename>/etc/passwd</filename> file, or <command>vigr</command> to edit <filename>/etc/group</filename>. These commands lock the file in question prior to running the text editor, (<command>vi</command> by default, unless the <varname>EDITOR</varname> environment variable has been altered). The <literal>-s</literal> option in these commands allows editing the corresponding <foreignphrase>shadow</foreignphrase> file.
cs_cz: K tomuto účelu je dostatečné pro editaci souboru <filename>/etc/passwd</filename> použít příkaz <command>vipw</command> nebo <command>vigr</command> pro editaci <filename>/etc/group</filename>. Tyto příkazy zamykají dotyčný soubor před spuštěním textového editoru, (<command>vi</command> ve výchozím nastavení, pokud nebyla proměnná prostředí <varname>EDITOR</varname> upravena). Volba <literal>-s</literal> u těchto příkazů umožňuje upravování odpovídajícího <foreignphrase>shadow</foreignphrase> souboru.

source: <emphasis>BACK TO BASICS</emphasis> Crypt, a one-way function
cs_cz: <emphasis>ZPĚT K ZÁKLADŮM</emphasis> Crypt, jednocestná funkce

source: <command>crypt</command> is a one-way function that transforms a string (<varname>A</varname>) into another string (<varname>B</varname>) in a way that <varname>A</varname> cannot be derived from <varname>B</varname>. The only way to identify <varname>A</varname> is to test all possible values, checking each one to determine if transformation by the function will produce <varname>B</varname> or not. It uses up to 8 characters as input (string <varname>A</varname>) and generates a string of 13, printable, ASCII characters (string <varname>B</varname>).
cs_cz: <primary>crypt</primary> je jednocestná funkce, která přemění řetězec (<varname>A</varname>) na jiný řetězec (<varname>B</varname>) takovým způsobem, že (<varname>A</varname>) nemůže být od řetězce (<varname>B</varname>) odvozen. Jediný způsob, jak identidikovat (<varname>A</varname>), je testování všech možných hodnot a kontrolovat každou z nich k určení, zda přeměna za pomocí funkce vytvoří (<varname>B</varname>), či ne. Používá do osmi znaků na vstupu (řetězec <varname>A</varname>) a generuje řetězec o třinácti tisknutelných ASCII znacích (řetězec <varname>B</varname>).

source: User List: <filename>/etc/passwd</filename>
cs_cz: Seznam uživatelů: <filename>/etc/passwd</filename>

source: Here is the list of fields in the <filename>/etc/passwd</filename> file:
cs_cz: Zde je seznam polí v souboru <filename>/etc/passwd</filename>:

source: login, for example <literal>rhertzog</literal>;
cs_cz: login, například <literal>rhertzog</literal>;

source: password: this is a password encrypted by a one-way function (<command>crypt</command>), relying on <literal>DES</literal>, <literal>MD5</literal>, <literal>SHA-256</literal> or <literal>SHA-512</literal>. The special value “<literal>x</literal>” indicates that the encrypted password is stored in <filename>/etc/shadow</filename>;
cs_cz: password: toto je heslo zašifrované jednocestnou funkcí (<command>crypt</command>), spoléhající na <literal>DES</literal>, <literal>MD5</literal>, <literal>SHA-256</literal> nebo <literal>SHA-512</literal>. Speciální hodnota “<literal>x</literal>” značí, že zašifrované heslo je uloženo v <filename>/etc/shadow</filename>

source: <literal>uid</literal>: unique number identifying each user;
cs_cz: <literal>uid</literal>: unikátní číslo identifikující každého uživatele;

source: <literal>gid</literal>: unique number for the user's main group (Debian creates a specific group for each user by default);
cs_cz: <literal>gid</literal>: uníkátní číslo pro uživatelovu hlavní skupinu (Debian vytváří ve výchozím nastavení konkrétní skupinu pro každého uživatele);

source: <literal>GECOS</literal>: data field usually containing the user's full name;
cs_cz: <literal>GECOS</literal>: datové pole obyčejně obsahující uživatelovo celé jméno;

source: login directory, assigned to the user for storage of their personal files (the environment variable <varname>$HOME</varname> generally points here);
cs_cz: login adresář, určený uživateli pro uložení jeho osobních souborů (proměnná prostředí <varname>$HOME</varname> sem většinou ukazuje);

source: program to execute upon login. This is usually a command interpreter (shell), giving the user free rein. If you specify <command>/bin/false</command> (which does nothing and returns control immediately), the user cannot login.
cs_cz: program ke spuštění při přihlášení. To je většinou příkazový interpret (shell), který dává uživateli volnou ruku. Pokud předepíšete <command>/bin/false</command> (což nedělá nic a vrací ihned kontrolu), uživatel se nemůže přihlásit.

source: <emphasis>BACK TO BASICS</emphasis> Unix group
cs_cz: <emphasis>ZPĚT K ZÁKLADŮM</emphasis> Unixová skupina

source: A Unix group is an entity including several users so that they can easily share files using the integrated permission system (by benefiting from the same rights). You can also restrict use of certain programs to a specific group.
cs_cz: Unixová skupina je entita zahrnující několik uživatelů, takže mohou snadno sdílet soubory za použití integrovaného systému povolení (těží z toho, že mají stejná práva). Můžete také zakázat použití některých programů určitým skupinám.

source: The Hidden and Encrypted Password File: <filename>/etc/shadow</filename>
cs_cz: Ukrytý a zašifrovaný soubor: <filename>/etc/shadow</filename>

source: The <filename>/etc/shadow</filename> file contains the following fields:
cs_cz: Soubor <primary><filename>/etc/shadow</filename></primary> zahrnuje následující pole:

source: several fields managing password expiration.
cs_cz: Několik polí řídících ukončení platnosti hesla.

source: <emphasis>DOCUMENTATION</emphasis> <filename>/etc/passwd</filename>, <filename>/etc/shadow</filename> and <filename>/etc/group</filename> file formats
cs_cz: <emphasis>DOKUMENTACE</emphasis> <filename>/etc/passwd</filename>, formáty souboru <filename>/etc/shadow</filename> a <filename>/etc/group</filename>

source: These formats are documented in the following man pages: <citerefentry><refentrytitle>passwd</refentrytitle><manvolnum>5</manvolnum></citerefentry>, <citerefentry><refentrytitle>shadow</refentrytitle><manvolnum>5</manvolnum></citerefentry>, and <citerefentry><refentrytitle>group</refentrytitle><manvolnum>5</manvolnum></citerefentry>.
cs_cz: Tyto formáty jsou zdokumentovány na následujících manuálových strankách: <citerefentry><refentrytitle>passwd</refentrytitle><manvolnum>5</manvolnum></citerefentry>, <citerefentry><refentrytitle>shadow</refentrytitle><manvolnum>5</manvolnum></citerefentry>, a <citerefentry><refentrytitle>group</refentrytitle><manvolnum>5</manvolnum></citerefentry>.

source: <emphasis>SECURITY</emphasis> <filename>/etc/shadow</filename> file security
cs_cz: <emphasi>BEZPEČNOST</emphasis> bezpečnost souborů <filename>/etc/shadow</filename>

source: <filename>/etc/shadow</filename>, unlike its alter-ego, <filename>/etc/passwd</filename>, cannot be read by regular users. Any encrypted password stored in <filename>/etc/passwd</filename> is readable by anybody; a cracker could try to “break” (or reveal) a password by one of several “brute force” methods which, simply put, guess at commonly used combinations of characters. This attack — called a "dictionary attack" — is no longer possible on systems using <filename>/etc/shadow</filename>.
cs_cz: <filename>/etc/shadow</filename>, na rozdíl od svého druhého já, <filename>/etc/passwd</filename>, nemohou číst běžní uživatelé. Kterékoli ze zašifrovaných hesel uložených v <filename>/etc/passwd</filename> si může kdokoli přečíst; hacker se může pokusit “rozluštit” (nebo odhalit) heslo pomocí některé z metod “hrubé síly”, která jednoduše hádá a zadává běžně užívané kombinace znaků. Tento útok — nazývaný "dictionary attack" — již není možný na systémech používajících <filename>/etc/shadow</filename>.

source: Modifying an Existing Account or Password
cs_cz: Změna existujícího účtu nebo hesla

source: The following commands allow modification of the information stored in specific fields of the user databases: <command>passwd</command> permits a regular user to change their password, which in turn, updates the <filename>/etc/shadow</filename> file; <command>chfn</command> (CHange Full Name), reserved for the super-user (root), modifies the <literal>GECOS</literal> field. <command>chsh</command> (CHange SHell) allows the user to change their login shell, however available choices will be limited to those listed in <filename>/etc/shells</filename>; the administrator, on the other hand, is not bound by this restriction and can set the shell to any program of their choosing.
cs_cz: Následující příkazy umožňují změnu informace uložené v určitých polích databáze uživatelů: <command>passwd</command> dovoluje běžnému uživateli změnit své heslo, což následně aktualizuje soubor <filename>/etc/shadow</filename>; <command>chfn</command> (CHange Full Name), rezervovaný pro uživatele super-user (root), mění pole <literal>GECOS</literal>. <command>chsh</command> (CHange SHell) umožňuje uživateli změnit svůj přihlašovací interpretr (login shell), nicméně možné volby jsou omezeny na ty, které jsou vyjmenovány v <filename>/etc/shells</filename>; správce, na druhou stranu, není těmito omezeními vázán a může nastavit interpretr na jakýkoli podle své volby.

source: Finally, the <command>chage</command> (CHange AGE) command allows the administrator to change the password expiration settings (the <literal>-l <replaceable>user</replaceable></literal> option will list the current settings). You can also force the expiration of a password using the <command>passwd -e <replaceable>user</replaceable></command> command, which will require the user to change their password the next time they log in.
cs_cz: Konečně, příkaz <command>chage</command> (CHange AGE) umožňuje správci změnit nastavení ukončení platnosti hesla (<literal>-l <replaceable>uživatel</replaceable></literal> volba vypíše seznam současných nastavení). Můžeze také násilně ukončit platnost hesla za použití příkazu <command>passwd -e <replaceable>uživatel</replaceable></command>, což bude vyžadovat po uživateli, aby změnil své heslo při příštím přihlášení.

source: Disabling an Account
cs_cz: Zablokování účtu

source: <primary>Disable an account</primary>
cs_cz: <primary>Zablokonání účtu</primary>

source: <primary>account</primary><secondary>disable</secondary>
cs_cz: <primary>účet</primary><secondary>zablokovat</secondary>

source: You may find yourself needing to “disable an account” (lock out a user), as a disciplinary measure, for the purposes of an investigation, or simply in the event of a prolonged or definitive absence of a user. A disabled account means the user cannot login or gain access to the machine. The account remains intact on the machine and no files or data are deleted; it is simply inaccessible. This is accomplished by using the command <command>passwd -l <replaceable>user</replaceable></command> (lock). Re-enabling the account is done in similar fashion, with the <literal>-u</literal> option (unlock).
cs_cz: Můžete se dostat do situace, kdy budete potřebovat “zablokovat účet” (nevpustit uživatele), jako kárné opatření, pro účely šetření nebo jednoduše v případě prodloužené nebo definitivní nepřítomnosti uživatele. Zablokovaný účet znamená, že se uživatel nemůže přihlásit nebo získat přístup k zařízení. Účet zůstává na zařízení nedotčený a žádná data nebo soubory nejsou vymazány; je jednoduše nedostupný. To je dosaženo za použití příkazu <command>passwd -l <replaceable>uživatel</replaceable></command> (lock). Odblokování účtu se udělá stejným způsobem, pomocí volby <literal>-u</literal> (unlock)

source: <emphasis>GOING FURTHER</emphasis> NSS and system databases
cs_cz: <emphasis>JDEME DÁLE</emphasis> NSS a databáze systému

source: Instead of using the usual files to manage lists of users and groups, you could use other types of databases, such as LDAP or <command>db</command>, by using an appropriate NSS (Name Service Switch) module. The modules used are listed in the <filename>/etc/nsswitch.conf</filename> file, under the <literal>passwd</literal>, <literal>shadow</literal> and <literal>group</literal> entries. See <xref linkend="sect.config-nss" /> for a specific example of the use of an NSS module by LDAP.
cs_cz: Namísto použití běžných souborů k řízení seznamů uživatelů a skupin, můžete použít jiné typy databází, jako je LDAP nebo <command>db</command>, za použití vhodného modulu NSS (Name Service Switch). Použité moduly jsou vypsány v souboru <filename>/etc/nsswitch.conf</filename>, pod vstupy <literal>passwd</literal>, <literal>shadow</literal> a <literal>group</literal>. Viz. <xref linkend="sect.config-nss" />, kde je konkrétní příklad použití NSS modulu prostřednictvím LDAP.

source: Group List: <filename>/etc/group</filename>
cs_cz: Seznam skupin: <filename>/etc/group</filename>

source: Groups are listed in the <filename>/etc/group</filename> file, a simple textual database in a format similar to that of the <filename>/etc/passwd</filename> file, with the following fields:
cs_cz: Skupiny jsou vypsány v souboru <filename>/etc/group</filename>, což je jednoduchá databáze ve formátu podobném souboru <filename>/etc/passwd</filename> s následujícími poli:

source: password (optional): This is only used to join a group when one is not a usual member (with the <command>newgrp</command> or <command>sg</command> commands, see sidebar <xref linkend="sidebar.working-with-several-groups" />);
cs_cz: password (volitelné): To se používá pro připojení se ke skupině, někým, kdo není normální člen (pomocí příkazů <command>newgrp</command> nebo <command>sg</command> viz. poznámka na straně <xref linkend="sidebar.working-with-several-groups" />);

source: <literal>gid</literal>: unique group identification number;
cs_cz: <literal>gid</literal>: jedinečné identifikační číslo skupiny

source: list of members: list of names of users who are members of the group, separated by commas.
cs_cz: seznam členů: seznam jmen uživatelů, kteří jsou členy skupiny, oddělených čárkami.

source: <emphasis>BACK TO BASICS</emphasis> Working with several groups
cs_cz: <emphasis>ZPĚT K ZÁKLADŮM</emphasis> Práce s několika skupinami

source: <primary>group</primary><secondary>change</secondary>
cs_cz: <primary>skupina</primary><secondary>změna</secondary>

source: Each user may be a member of many groups; one of them is their “main group”. A user's main group is, by default, created during initial user configuration. By default, each file that a user creates belongs to them, as well as to their main group. This is not always desirable; for example, when the user needs to work in a directory shared by a group other than their main group. In this case, the user needs to change their main group using one of the following commands: <command>newgrp</command>, which starts a new shell, or <command>sg</command>, which simply executes a command using the supplied alternate group. These commands also allow the user to join a group to which they do not belong. If the group is password protected, they will need to supply the appropriate password before the command is executed.
cs_cz: Každý uživatel může být členem mnoha skupin; jedna z nich je “hlavní skupina”. Uživatelova hlavní skupina je, v počátečním nastavení, vytvořena během prvotního uživatelského nastavení. Ve výchozím nastavení, každý soubor, který uživatel vytvoří, mu patří, stejně jako jeho skupině. Toto není vždy žádoucí; například, pokud uživatel potřebuje pracovat v adresáři sdíleném jinou skupinou, než je jeho hlavní skupina. V tomto případě, uživatel musí změnit svoji hlavní skupinu za použití jednoho z následujících příkazů: <command>newgrp</command>, který spustí nový interpretr (shell) nebo <command>sg</command>, který jednoduše spustí příkaz za použití doplněné alternativní skupiny. Tyto příkazy také umožňují uživateli se připojit ke skupině, ke které nepatří. Pokud je skupina chráněná heslem, bude muset doplnit správné heslo před příkaz, který se spouští.

source: Alternatively, the user can set the <literal>setgid</literal> bit on the directory, which causes files created in that directory to automatically belong to the correct group. For more details, see sidebar <xref linkend="sidebar.setgid-dir" />.
cs_cz: Popřípadě, uživatel může nastavit <literal>setgid</literal> bit na adresáři, který zapříčiní to, že soubory vytvořené v tomto adresáři automaticky patří správné skupině. Pro více detailů se podívejte na poznámku na straně <xref linkend="sidebar.setgid-dir" />.

source: The <command>id</command> command displays the current state of a user, with their personal identifier (<varname>uid</varname> variable), current main group (<varname>gid</varname> variable), and the list of groups to which they belong (<varname>groups</varname> variable).
cs_cz: Příkaz <command>id</command> zobrazí současný stav uživatele, s jeho osobním identifikátorem (proměnnou <varname>uid</varname>), současnou hlavní skupinou (proměnnou <varname>gid</varname>) a seznamem skupin, ke kterým patří (proměnnou <varname>groups</varname>).

source: The <command>addgroup</command> and <command>delgroup</command> commands add or delete a group, respectively. The <command>groupmod</command> command modifies a group's information (its <literal>gid</literal> or identifier). The command <command>passwd -g <replaceable>group</replaceable></command> changes the password for the group, while the <command>passwd -r -g <replaceable>group</replaceable></command> command deletes it.
cs_cz: Příkazy <command>addgroup</command> a <command>delgroup</command> skupinu přidávají nebo respektive mažou. Příkaz <command>groupmod</command> mění informace skupiny (její <literal>gid</literal> nebo identifikátor). Příkaz <command>passwd -g <replaceable>skupina</replaceable></command> mění heslo skupiny, zatímco příkaz <command>passwd -r -g <replaceable>skupina</replaceable></command> jej smaže.

source: <primary>group</primary><secondary>creation</secondary>
cs_cz: <primary>skupina</primary><secondary>vytvoření</secondary>

source: <primary>creation</primary><secondary>of groups</secondary>
cs_cz: <primary>vytvoření</primary><secondary>skupin</secondary>

source: <primary>group</primary><secondary>deletion</secondary>
cs_cz: <primary>skupina</primary><secondary>vymazání</secondary>

source: <primary>deletion of a group</primary>
cs_cz: <primary>vymazání skupiny</primary>

source: The <command>getent</command> (get entries) command checks the system databases the standard way, using the appropriate library functions, which in turn call the NSS modules configured in the <filename>/etc/nsswitch.conf</filename> file. The command takes one or two arguments: the name of the database to check, and a possible search key. Thus, the command <command>getent passwd rhertzog</command> will give the information from the user database regarding the user <literal>rhertzog</literal>.
cs_cz: Příkaz <command>getent</command> (get entries) prohledává systémové databáze standardním způsobem za použití odpovídajících funkcí knihovny, které obratem volají NSS moduly nastavené v souboru <filename>/etc/nsswitch.conf</filename>. Příkaz přijímá jeden nebo dva argumenty: jméno databáze, která se má kontrolovat a možný vyhledávací klíč. Takže, příkaz <command>getent passwd rhertzog</command> dá informace z uživatelské databáze ohledně uživatele <literal>rhertzog</literal>.

source: Creating Accounts
cs_cz: Vytváření účtů

source: <primary>account</primary><secondary>creation</secondary>
cs_cz: <primary>účet</primary><secondary>vytvoření</secondary>

source: <primary>creation</primary><secondary>of user accounts</secondary>
cs_cz: <primary>vytvoření</primary><secondary>uživatelského konta</secondary>

source: One of the first actions an administrator needs to do when setting up a new machine is to create user accounts. This is typically done using the <command>adduser</command> command which takes a user-name for the new user to be created, as an argument.
cs_cz: Jeden z prvních úkonů, co administrátor musí udělat při nastavování nového zařízení, je vytvořit uživatelské konto. To se typicky udělá použitím příkazu <command>adduser</command>, který přijme pro vytvoření nového uživatele uživatelské jméno (user-name) jako argument.

source: The <command>adduser</command> command asks a few questions before creating the account, but its usage is fairly straightforward. Its configuration file, <filename>/etc/adduser.conf</filename>, includes all the interesting settings: it can be used to automatically set a quota for each new user by creating a user template, or to change the location of user accounts; the latter is rarely useful, but it comes in handy when you have a large number of users and want to divide their accounts over several disks, for instance. You can also choose a different default shell.
cs_cz: Příkaz <command>adduser</command> položí několik otázek před vytvořením účtu, ale jeho použití je velice přímočaré. Jeho nastavovací soubor <filename>/etc/adduser.conf</filename> obsahuje veškerá zajímavá nastavení: může být použit pro automatické nastavní kvóty pro každého nového uživatele tím, že vytvoří uživatelskou šablonu nebo může být použit pro změnu umístění uživatelských účtů; ten posledně jmenovaný je málokdy použitelný, ale přijde vhod, když máte například velký počet uživatelů a chcete rozdělit jejich účty mezi několik disků. Můžete také vybrat jiný přednastavený shell (interpret).

source: <emphasis>BACK TO BASICS</emphasis> Quota
cs_cz: <emphasis>ZPĚT K ZÁKLDŮM</emphasis> Quota

source: The term “quota” refers to a limit on machine resources that a user is allowed to use. This frequently refers to disk space.
cs_cz: Termín “quota” odkazuje na omezení zdrojů zařízení, které jsou uživateli povoleny použít. Často se jedná o místo na disku.

source: The creation of an account populates the user's home directory with the contents of the <filename>/etc/skel/</filename> template. This provides the user with a set of standard directories and configuration files.
cs_cz: Vytvoření účtu osídlí uživatelův domovský adresář obsahem šablony <filename>/etc/skel/</filename>. Ten vybaví uživatele souborem standardních adresářů a nastavovacích souborů.

source: <primary>group</primary><secondary>add a user</secondary>
cs_cz: <primary>skupina</primary><secondary>přidání uživatele</secondary>

source: <primary>add a user to a group</primary>
cs_cz: <primary>přidání uživatele do skupiny</primary>

source: In some cases, it will be useful to add a user to a group (other than their default “main” group) in order to grant them additional permissions. For example, a user who is included in the <emphasis>audio</emphasis> group can access audio devices (see sidebar <xref linkend="sidebar.special-files" />). This can be achieved with a command such as <command>adduser <replaceable>user</replaceable> <replaceable>group</replaceable></command>.
cs_cz: V některých případech je užitečné přidat uživatele do skupiny (jiné, než je jeho “hlavní” skupina) za účelem postoupení mu dodatečných povolení. Například, uživatel, který je zahrnut ve skupině <emphasis>audio</emphasis> může přistoupit k audio zařízením (více v poznámce na straně <xref linkend="sidebar.special-files" />). Toho může být dosaženo příkazem jako je <command>adduser <replaceable>uživatel</replaceable> <replaceable>group</replaceable></command>.

source: <emphasis>BACK TO BASICS</emphasis> Device access permissions
cs_cz: <emphasis>ZPĚT K ZÁKLADŮM</emphasis> Povolení pro přístup k zařízením

source: <primary>device</primary><secondary>access permissions</secondary>
cs_cz: <primary>zařízení</primary><secondary>povolení přístupu</secondary>
