Repository: jarabt/Hbook
Catalog: 08_basic-configuration.po
Languages: cs_cz

source: In ancient times, some kernel modules did automatically load when you tried to access the corresponding device file. This is no longer the case, and the peripheral's special file no longer exists prior to loading the module; this is no big deal, since most modules are loaded on boot thanks to automatic hardware detection. But for undetectable peripherals (such as very old disk drives or PS/2 mice), this doesn't work. Consider adding the modules, <literal>floppy</literal>, <literal>psmouse</literal> and <literal>mousedev</literal> to <filename>/etc/modules</filename> in order to force loading them on boot.
cs_cz: V dávných časech se některé moduly jádra automaticky nahrály, jakmile jste se pokusili přistoupit k odpovídajícímu souboru daného zařízení. Toto už více není tento případ a speciální soubor periferních zařízení už více neexistuje před nahrátím modulu; to není žádná velká věc, protože moduly se nahrávají při bootu díky automatickému rozpoznávání hardwaru. Ale pro nerozpoznatelná periferní zařízení (jako jsou velmi staré pevné disky nebo myši PS/2) toto nefunguje. Zvažte tak přidání modulů <literal>floppy</literal>, <literal>psmouse</literal> a <literal>mousedev</literal> do <filename>/etc/modules</filename> za účelem vynucení si jejich nahrátí při bootování.

source: <primary>hard drive, names</primary>
cs_cz: <primary>pevný disk, jména</primary>

source: <primary>names</primary><secondary>of hard drives</secondary>
cs_cz: <primary>jména</primary><secondary>pevných disků</secondary>

source: Configuration of the bootloader must identify the different hard drives and their partitions. Linux uses “block” special files stored in the <filename>/dev/</filename> directory, for this purpose. Since Debian <emphasis role="distribution">Squeeze</emphasis>, the naming scheme for hard drives has been unified by the Linux kernel, and all hard drives (IDE/PATA, SATA, SCSI, USB, IEEE 1394) are now represented by <filename>/dev/sd*</filename>.
cs_cz: Nastavení boorloaderu musí identifikovat různé pevné disky a jejich oddíly. Linux pto tyto účely používá “blokové” speciální soubory uložené v adresáři <filename>/dev/</filename>. Od Debianu <emphasis role="distribution">Squeeze</emphasis> bylo jmenovací schéma pro pevné disky unifikováno Linuxovým jádrem a všechny pevné disky (IDE/PATA, SATA, SCSI, USB, IEEE 1394) jsou nyní zastoupené <filename>/dev/sd*</filename>.

source: Each partition is represented by its number on the disk on which it resides: for instance, <filename>/dev/sda1</filename> is the first partition on the first disk, and <filename>/dev/sdb3</filename> is the third partition on the second disk.
cs_cz: Každý oddíl je zasoupen svým číslem na disku, na kterém se nachází: například <filename>/dev/sda1</filename> je první oddíl na prvním disku a <filename>/dev/sdb3</filename> je třetí oddíl na druhém disku.

source: <primary>partition</primary><secondary>primary</secondary>
cs_cz: <primary>oddíl</primary><secondary>primární</secondary>

source: <primary>partition</primary><secondary>extended</secondary>
cs_cz: <primary>oddíl</primary><secondary>rozšířený</secondary>

source: <primary>partition</primary><secondary>secondary</secondary>
cs_cz: <primary>oddíl</primary><secondary>sekundární</secondary>

source: <primary>partition table</primary><secondary>MS-DOS format</secondary>
cs_cz: <primary>tabulka oddílů</primary><secondary>formát MS-DOS</secondary>

source: The PC architecture (or “i386”, including its younger cousin “amd64”) has long been limited to using the “MS-DOS” partition table format, which only allows four “primary” partitions per disk. To go beyond this limitation under this scheme, one of them has to be created as an “extended” partition, and it can then contain additional “secondary” partitions. These secondary partitions are numbered from 5. Thus the first secondary partition could be <filename>/dev/sda5</filename>, followed by <filename>/dev/sda6</filename>, etc.
cs_cz: PC architektura (nebo “i386”, včetně svého mladšího příbuzného “amd64”) byla dlouho omezena na použití formát oddílové tabulky “MS-DOS”, který umožňoval pouze čtyři “primární” oddíly na jeden disk. K překročení tohoto limitu v rámci tohoto režimu, jedem z nich musel být vytvořen jako “rozšířený” oddíl a ten potom mohl obsahovat další “sekundární” oddíly. Tyto sekundární oddíly jsou číslovány od 5. Takže, první sekundární oddíl může být <filename>/dev/sda5</filename>, následovaný <filename>/dev/sda6</filename> apod.

source: Another restriction of the MS-DOS partition table format is that it only allows disks up to 2 TiB in size, which is becoming a real problem with recent disks.
cs_cz: Dalším omezením formátu oddílové tabulky MS-DOS je to, že povoluje pouze disky do velikosti 2 TiB, což se stává skutečným problémem u současných disků.

source: <primary>GPT</primary><secondary>partition table format</secondary>
cs_cz: <primary>GPT</primary><secondary>formát oddílové tabulky</secondary>

source: <primary>partition table</primary><secondary>GPT format</secondary>
cs_cz: <primary>oddílová tabulka</primary><secondary>formát GPT</secondary>

source: A new partition table format called GPT loosens these constraints on the number of partitions (it allows up to 128 partitions when using standard settings) and on the size of the disks (up to 8 ZiB, which is more than 8 billion terabytes). If you intend to create many physical partitions on the same disk, you should therefore ensure that you are creating the partition table in the GPT format when partitioning your disk.
cs_cz: Nový formát oddílové tabulky nazývaný GPT zmírňuje tato omezení ohledně počtu oddílů (povoluje až 128 oddílů za použití standardního nastevení) a velikosti disků (až do 8 ZiB, což je více než 8 miliard terabajtů). Pokud zamýšlíte vytvoření mnoha fyzických oddílů na tom samém disku, měli byste se proto ujistit, že vytváříte oddílovou tabulku ve formátu GPT, když dělíte disk.

source: It is not always easy to remember what disk is connected to which SATA controller, or in third position in the SCSI chain, especially since the naming of hotplugged hard drives (which includes among others most SATA disks and external disks) can change from one boot to another. Fortunately, <command>udev</command> creates, in addition to <filename>/dev/sd*</filename>, symbolic links with a fixed name, which you could then use if you wished to identify a hard drive in a non-ambiguous manner. These symbolic links are stored in <filename>/dev/disk/by-id</filename>. On a machine with two physical disks, for example, one could find the following:
cs_cz: Není vždy snadné si zapamatovat, který disk je připojen ke kterému SATA kontroleru nebo ve třetí pozici v SCSI řetězci, obzvláště proto, že pojemnování hotplug (připojeného za běhu počítače) pevných disků (což zahrnuje mimo jiné většinu SATA disků a externích disků) se může změnit od jednoho bootování ke druhému). Naštěstí <command>udev</command> vytváří, navíc ke <filename>/dev/sd*</filename> symbolický odkaz se stálým jménem, které by jste potom mohli použít, pokud si budete přát identifikovat pevný disk ne nejednoznačným způsobem. Tyto symbolické odkazy jsou uloženy v <filename>/dev/disk/by-id</filename>. Na zařízení se dvěma fyzickými disky, například, můžete najít následující:

source: Note that some disks are listed several times (because they behave simultaneously as ATA disks and SCSI disks), but the relevant information is mainly in the model and serial numbers of the disks, from which you can find the peripheral file.
cs_cz: Povšiměte si, že některé disky jsou uvedeny několikrát (protože se chovají zároveň jako ATA disky i jako SCSI disky), ale důležité informace spočívají především v modelu a sériovém čísle disků, ze kterých můžete zjistit soubor periferního zařízení.

source: The example configuration files given in the following sections are based on the same setup: a single SATA disk, where the first partition is an old Windows installation and the second contains Debian GNU/Linux.
cs_cz: Příklad nastavovacích souborů uvedený v nálsedujících sekcích je založen na stejném nastavení: jeden SATA disk, kde je první oddíl stará instalace Windows a druhý obsahuje Debian GNU/Linux.

source: Configuring LILO
cs_cz: Nastavení LILO

source: <emphasis>LILO</emphasis> (LInux LOader) is the oldest bootloader — solid but rustic. It writes the physical address of the kernel to boot on the MBR, which is why each update to LILO (or its configuration file) must be followed by the command <command>lilo</command>. Forgetting to do so will render a system unable to boot if the old kernel was removed or replaced as the new one will not be in the same location on the disk.
cs_cz: <emphasis>LILO</emphasis> (LInux LOader) je nejstarší bootloader — spolehlivý, ale prostý. Zapíše fyzickou adresu jádra určeného k zavádění na MBR, což je důvod, proč každá aktualizace LILO (nebo jeho nastavovacího souboru) musí být následována příkazem <command>lilo</command>. Pokud se toto opomine udělat, učiní to systém neschopným bootovat, pokud staré jádro bylo odstraněno nebo nahrazeno a nové nebude ve stejném místě na disku.

source: LILO's configuration file is <filename>/etc/lilo.conf</filename>; a simple file for standard configuration is illustrated in the example below.
cs_cz: Soubor nastavení nahráveče LILO ja <filename>/etc/lilo.conf</filename>; jednoduchý soubor standardního nastavení je znázorněn v níže uvedeném příkladu.

source: LILO configuration file
cs_cz: Soubor nastavení nahrávače LILO

source: GRUB 2 Configuration
cs_cz: Nastavení GRTUB 2

source: <emphasis>GRUB</emphasis> (GRand Unified Bootloader) is more recent. It is not necessary to invoke it after each update of the kernel; <emphasis>GRUB</emphasis> knows how to read the filesystems and find the position of the kernel on the disk by itself. To install it on the MBR of the first disk, simply type <command>grub-install /dev/sda</command>. <indexterm><primary><command>grub-install</command></primary></indexterm>
cs_cz: <emphasis>GRUB</emphasis> (GRand Unified Bootloader) je současnější. Není jej nezbytné vyvolávat po každé aktualizaci jádra; <emphasis>GRUB</emphasis> ví, jak číst souborové systémy a nalézt umístění jádra na disku svépomocí. K jeho nainstalování na MBR prvního disku jednoduše zadejte <command>grub-install /dev/sda</command>. <indexterm><primary><command>grub-install</command></primary></indexterm>

source: <emphasis>NOTE</emphasis> Disk names for GRUB
cs_cz: <emphasis>POZNÁMKA</emphasis> Disková jména pro GRUB

source: GRUB can only identify hard drives based on information provided by the BIOS. <literal>(hd0)</literal> corresponds to the first disk thus detected, <literal>(hd1)</literal> the second, etc. In most cases, this order corresponds exactly to the usual order of disks under Linux, but problems can occur when you associate SCSI and IDE disks. GRUB stores correspondences that it detects in the file <filename>/boot/grub/device.map</filename>. If you find errors there (because you know that your BIOS detects drives in a different order), correct them manually and run <command>grub-install</command> again. <command>grub-mkdevicemap</command> can help creating a <filename>device.map</filename> file from which to start.
cs_cz: GRUB může identifikovat pevné disky na základě informací poskytnutých BIOSem. <literal>(hd0)</literal> odpovídá prvnímu disku takto takto rozeznanému, <literal>(hd1)</literal> druhému apod. Ve většině případů toto pořadí odpovídá přesně obvyklému pořadí disků pod Linuxem, ale mohou se vyskytnout problémy, pokud k sobě vztáhnete SCSI a IDE disky. GRUB ukládá shody, které zaznamená do souboru <filename>/boot/grub/device.map</filename>. Pokud zde naleznete chyby (protože víte, že váš BIOS rozeznává jednotky v rozdílném pořadí), opravte je manuálně a spusťe <command>grub-install</command> znovu. <command>grub-mkdevicemap</command> může pomoci vytvořit soubor <filename>device.map</filename>, od kterého se začíná.

source: Partitions also have a specific name in GRUB. When you use “classical” partitions in MS-DOS format, the first partition on the first disk is labeled, <literal>(hd0,msdos1)</literal>, the second <literal>(hd0,msdos2)</literal>, etc.
cs_cz: Oddíly také mají v nahrávači GRUB specifická jména. Pokud použijete “klasické” oddíly ve formátu MS-DOS, první oddíl prvního disku je označen jako <literal>(hd0,msdos1)</literal>, druhý <literal>(hd0,msdos2)</literal> atd.

source: GRUB 2 configuration is stored in <filename>/boot/grub/grub.cfg</filename>, but this file (in Debian) is generated from others. Be careful not to modify it by hand, since such local modifications will be lost the next time <command>update-grub</command> is run (which may occur upon update of various packages). The most common modifications of the <filename>/boot/grub/grub.cfg</filename> file (to add command line parameters to the kernel or change the duration that the menu is displayed, for example) are made through the variables in <filename>/etc/default/grub</filename>. To add entries to the menu, you can either create a <filename>/boot/grub/custom.cfg</filename> file or modify the <filename>/etc/grub.d/50_custom</filename> file. For more complex configurations, you can modify other files in <filename>/etc/grub.d</filename>, or add to them; these scripts should return configuration snippets, possibly by making use of external programs. These scripts are the ones that will update the list of kernels to boot: <filename>10_linux</filename> takes into consideration the installed Linux kernels; <filename>20_linux_xen</filename> takes into account Xen virtual systems, and <filename>30_os-prober</filename> lists other operating systems (Windows, OS X, Hurd).
cs_cz: Natavení GRUB 2 je uloženo v <filename>/boot/grub/grub.cfg</filename>, ale tento soubor je (v Debianu) generován z jiných. Dbejte na to, ho nemodifikovat manuálně, protože takové lokální změny se ztratí, jakmile se příště spustí <command>update-grub</command> (což se může stát při aktualizaci různých balíčků). Nejběžnější modifikace souboru <filename>/boot/grub/grub.cfg</filename> (přidání parametrů příkazového řádku k jádru nebo změna času trvání zobrazení menu, například) jsou učiněna prostřednictvím proměnných v <filename>/etc/default/grub</filename>. K přidání položek do menu můžete buď vytvořit soubor <filename>/boot/grub/custom.cfg</filename> nebo změnit soubor <filename>/etc/grub.d/50_custom</filename>. Pro komplexnější nastavení, můžete pozměnit další soubory v <filename>/etc/grub.d</filename> nebo je přidat; tyto skripty by měly vrátit konfigurační snippety (fragmenty kódů), pravděpodobně pomocí externích programů. Tyto skripty jsou těmi, které budou aktualizovat seznam jader k zavádění: <filename>10_linux</filename> bere v úvahu nainstalovaná Linuxová jádra; <filename>20_linux_xen</filename> zohledňuje virtuální systémy Xen a <filename>30_os-prober</filename> vrací seznam dalších operačních systémů (Windows, OS X, Hurd).

source: For Macintosh Computers (PowerPC): Configuring Yaboot
cs_cz: Pro nastavení počítačů Macintosh (Power PC): nastavení nahrávače Yaboot

source: Yaboot is the bootloader used by old Macintosh computers using PowerPC processors. They do not boot like PCs, but rely on a “bootstrap” partition, from which the BIOS (or OpenFirmware) executes the loader, and on which the <command>ybin</command> program installs <command>yaboot</command> and its configuration file. You will only need to run this command again if the <filename>/etc/yaboot.conf</filename> is modified (it is duplicated on the bootstrap partition, and <command>yaboot</command> knows how to find the position of the kernels on the disks).
cs_cz: Yaboot je bootloader používaný starými počítači Macintosh používajícími procesory PowerPC. Ty se nebootují stejně jako PC, ale spoléhají na paměťový oddíl “bootstrap”, ze kterého BIOS (nebo OpenFirmware) spouští nahrávač a na který program <command>ybin</command> instaluje <command>yaboot</command> a své nastavovací soubory. Znovu budete muset tento program spustit, pokud bude <filename>/etc/yaboot.conf</filename> změněn (je okopírovaný na oddílu bootstrap a <command>yaboot</command> ví, jak nalézt umístění jader na discích).

source: Before executing <command>ybin</command>, you must first have a valid <filename>/etc/yaboot.conf</filename>. The following is an example of a minimal configuration. <indexterm><primary><command>ybin</command></primary></indexterm>
cs_cz: Před spuštěním <command>ybin</command> musíte nejdříve mít platný <filename>/etc/yaboot.conf</filename>. Následuje příklad minimálního nastavení. <indexterm><primary><command>ybin</command></primary></indexterm>.

source: Yaboot configuration file
cs_cz: Nastavovací soubor yaboot

source: Other Configurations: Time Synchronization, Logs, Sharing Access…
cs_cz: Jiná nastavení: časová synchronizace, logy, sdílení přístupu…

source: The many elements listed in this section are good to know for anyone who wants to master all aspects of configuration of the GNU/Linux system. They are, however, treated briefly and frequently refer to the documentation.
cs_cz: Spoustu prvků vyjmenovaných v této sekci je dobré vědět pro kohokoliv, kdo chce zvládat všechny aspekty nastavení systému GNU/Linux. Každopádně, jsou probírány stručně a často odkazují na dokumentaci.

source: Timezone
cs_cz: Časová zóna

source: <emphasis>BACK TO BASICS</emphasis> Symbolic links
cs_cz: <emphasis>ZPĚT K ZÁKLADŮM</emphasis> Symbolické odkazy

source: <primary>link</primary><secondary>symbolic</secondary>
cs_cz: <primary>odkaz</primary><secondary>symbolický</secondary>

source: <primary>symbolic link</primary>
cs_cz: <primary>symbolický odkaz</primary>

source: A symbolic link is a pointer to another file. When you access it, the file to which it points is opened. Removal of the link will not cause deletion of the file to which it points. Likewise, it does not have its own set of permissions, but rather retains the permissions of its target. Finally, it can point to any type of file: directories, special files (sockets, named pipes, device files, etc.), even other symbolic links.
cs_cz: Symbolický odkaz je ukazatel na jiný soubor. Jakmile k němu přistoupíte, soubor, na který ukazuje se otevře. Odstranění odkazu nezpůsobí smazání souboru, na který ukazuje. Obdobně, nemá svoji vlastní sadu povolení, ale spíše si ponechává povolení svého terče. Nakonec, může ukazovat na jakýkoli typ souboru: adresáře, speciální soubory (patice, pojmenované roury, soubory zařízení apod.) i jiné symbolické odkazy.

source: The <command>ln -s <replaceable>target</replaceable> <replaceable>link-name</replaceable></command> command creates a symbolic link, named <replaceable>link-name</replaceable>, pointing to <replaceable>target</replaceable>.
cs_cz: Příkaz <command>ln -s <replaceable>terč</replaceable> <replaceable>odkaz-jméno</replaceable></command> vytvoří symbolický odkaz, pojmenovaný <replaceable>odkaz-jméno</replaceable>, ukazující na <replaceable>terč</replaceable>.

source: If the target does not exist, then the link is “broken” and accessing it will result in an error indicating that the target file does not exist. If the link points to another link, you will have a “chain” of links that turns into a “cycle” if one of the targets points to one of its predecessors. In this case, accessing one of the links in the cycle will result in a specific error (“too many levels of symbolic links”); this means the kernel gave up after several rounds of the cycle.
cs_cz: Pokud terč neexistuje, je potom odkaz “pokažený” a přístup k němu bude mít za následek chybu označující, že cílený soubor neexistuje. Pokud odkaz ukazuje na jiný odkaz, budete mít “řetěz” odkazů, ze kterého se stane “cyklus”, pokud jeden z terčů ukazuje na jeden ze svých předchůdců. V tomto případě, při přistoupení na jeden z odkazů v cyklu vyústí ve zvláštní chybu (“příliš mnoho úrovní symbolických odkazů”); což znamená, že to jádro vzdalo po několika kolech cyklu.

source: The timezone, configured during initial installation, is a configuration item for the <emphasis role="pkg">tzdata</emphasis> package. To modify it, use the <command>dpkg-reconfigure tzdata</command> command, which allows you to choose the timezone to be used in an interactive manner. Its configuration is stored in the <filename>/etc/timezone</filename> file. Additionally, the corresponding file in the <filename>/usr/share/zoneinfo</filename> directory is copied into <filename>/etc/localtime</filename>; this file contains the rules governing the dates where daylight saving time is active, for countries that use it.
cs_cz: Časová zóna, nastavovaná během počáteční instalace je nastavovací položka pro balíček <emphasis role="pkg">tzdata</emphasis>. K jeho změně použijte příkaz <command>dpkg-reconfigure tzdata</command>, který umožní výběr časové zóny k použití interaktivním způsobem. Jeho nastavení je uloženo v souboru <filename>/etc/timezone</filename>. Navíc, odpovídající soubor v adresáři <filename>/usr/share/zoneinfo</filename> je zkopírován do <filename>/etc/localtime</filename>; tento soubor obsahuje pravidla, kterými se řídí data, kde je aktivní letní čas, u států, které jej používají.

source: <primary><filename>timezone</filename></primary>
cs_cz: <primary><filename>časová zóna</filename></primary>

source: <primary><filename>zoneinfo</filename></primary>
cs_cz: <primary><filename>info zóny</filename></primary>

source: <primary>daylight saving time</primary>
cs_cz: <primary>letní čas</primary>

source: When you need to temporarily change the timezone, use the <varname>TZ</varname> environment variable, which takes priority over the configured system default:
cs_cz: Pokud chcete přechodně změnit časovou zónu, použijte proměnnou prosředí <varname>TZ</varname>, která má prioritu před přednastavením systémového nastavení:

source: <emphasis>NOTE</emphasis> System clock, hardware clock
cs_cz: <emphasis>POZNÁMKA</emphasis> Hodiny systému, hodiny hardwaru

source: There are two time sources in a computer. A computer's motherboard has a hardware clock, called the “CMOS clock”. This clock is not very precise, and provides rather slow access times. The operating system kernel has its own, the software clock, which it keeps up to date with its own means (possibly with the help of time servers, see <xref linkend="sect.time-synchronization" />). This system clock is generally more accurate, especially since it doesn't need access to hardware variables. However, since it only exists in live memory, it is zeroed out every time the machine is booted, contrary to the CMOS clock, which has a battery and therefore “survives” rebooting or halting of the machine. The system clock is, thus, set from the CMOS clock during boot, and the CMOS clock is updated on shutdown (to take into account possible changes or corrections if it has been improperly adjusted).
cs_cz: V počítači existují dva časové zdroje. Základní deska počítače má hardwarové hodiny, nazývané “CMOS clock”. Tyto hodiny nejsou příliš přesné a poskytují časy poměrně pomalým přístupem. Jádro operačního systému má svoje vlastní, softwarové hodiny, které udržuje v aktuálním stavu svými vlastními prosředky (třeba za pomoci časového serveru, viz. <xref linkend="sect.time-synchronization" />). Tento systém hodin je obecně přesnější, zvláště proto, že nepotřebuje přístup k hardwarovým proměnným. Každopádně, protože existuje pouze v živé paměti, je vynulován pokaždé, když se zařízení bootuje, narozdíl od hodin CMOS, které mají baterii a proto “přežívají” rebootování nebo zastavení zařízení. Systémové hodiny jsou tedy nastaveny z CMOS hodin během bootování a CMOS hodiny jsou aktualizovány při vypnutí (aby se vzali v úvahu možné změny nebo korekce, pokud byly nesprávně seřízeny).
