Repository: jarabt/Hbook
Catalog: 08_basic-configuration.po
Languages: cs_cz

source: As far as file names are concerned, the migration can be relatively simple. The <command>convmv</command> tool (in the package with the same name) was created specifically for this purpose; it allows renaming files from one encoding to another. The use of this tool is relatively simple, but we recommend doing it in two steps to avoid surprises. The following example illustrates a UTF-8 environment containing directory names encoded in ISO-8859-15, and the use of <command>convmv</command> to rename them.
cs_cz: Co se týká pouze jmen souborů, přechod může být relativně snadný. Nástroj <command>convmv</command> (v balíčku toho stejného jména) byl vytvořen speciálně pro tento účel; dovoluje přejmenování souborů z jednoho kódování na druhé. Použití tohoto nástroje je relativně snadné, ale aby jste předešli nepříjemným překvapením, doporučujeme tak učinit ve dvou krocích. Následující příklad názorně ukazuje prostředí UTF-8 obsahující jména adresářů kódovaných v ISO-8859-15 a použití <command>convmv</command> k jejich přejmenování.

source: For the file content, conversion procedures are more complex due to the vast variety of existing file formats. Some file formats include encoding information that facilitates the tasks of the software used to treat them; it is sufficient, then, to open these files and re-save them specifying UTF-8 encoding. In other cases, you have to specify the original encoding (ISO-8859-1 or “Western”, or ISO-8859-15 or “Western (Euro)”, according to the formulations) when opening the file.
cs_cz: Pro obsah souboru jsou postupy převodu komplexnější z důvodu ohromné rozmanitosti existujících formátů souborů. Některé formáty souborů zahrnují informace o kódování, které usnadňují úlohu softwaru, který je použit na jejich zpracování; je potom vhodné tyto soubory otevřít a znovu uložit za specifikace kódování UTF-8. V ostatních případech musíte uvést původní kódování (ISO-8859-1 či “Western” nebo ISO-8859-15 či “Western (Euro)”, podle formulace) při otevírání souboru.

source: For simple text files, you can use <command>recode</command> (in the package of the same name) which allows automatic recoding. This tool has numerous options so you can play with its behavior. We recommend you consult the documentation, the <citerefentry> <refentrytitle>recode</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> man page, or the <citerefentry> <refentrytitle>recode</refentrytitle> </citerefentry> info page (more complete).
cs_cz: Pro obyčejné textové soubory můžete použít <command>recode</command> (v balíčku pod stejným jménem), který umožňuje automatické znovu kódováníl. Tento nástroj má několik voleb, takže si můžete s pohrát s jeho chováním. Doporučujeme nahédnout do dokumentace, manuálové stránky <citerefentry> <refentrytitle>recode</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> nebo do info stránky (která je kompletnější).

source: Configuring the Network
cs_cz: Nastavení sítě

source: <emphasis>BACK TO BASICS</emphasis> Essential network concepts (Ethernet, IP address, subnet, broadcast)
cs_cz: <emphasis>ZPĚT K ZÁKLADŮM</emphasis> Základní síťové koncepty (Ethernet, IP adresa, subnet, broadcast)

source: <primary>connector, RJ45</primary>
cs_cz: <primary>konektor, RJ45</primary>

source: <primary>RJ45 connector</primary>
cs_cz: <primary>RJ45 konektor</primary>

source: Most modern local networks use the Ethernet protocol, where data is split into small blocks called frames and transmitted on the wire one frame at a time. Data speeds vary from 10 Mb/s for older Ethernet cards to 10 Gb/s in the newest cards (with the most common rate currently growing from 100 Mb/s to 1 Gb/s). The most widely used cables are called 10BASE-T, 100BASE-T, 1000BASE-T or 10GBASE-T depending on the throughput they can reliably provide (the T stands for “twisted pair”); those cables end in an RJ45 connector. There are other cable types, used mostly for speeds of 1 Gb/s and above.
cs_cz: Nejmodernější lokální sítě používají Ethernet protokol, kde jsou data rozštěpena na malé bloky nazývané snímky (frames) a přeneseny kabelem jednoho snímku v daný moment. Datová rychlost je různá od 10 Mb/s u starších Ethernetových karet, po 10 Gb/s v případě nejnovějších karet (nejběžnější tempo v současnosti roste na rozmězí mezi 100 Mb/s a 1 Gb/s). Nejrozšířenější kabely se jmenují 10BASE-T, 100BASE-T, 1000BASE-T nebo 10GBASE-T, v závislosti na průchodnosti, kterou mohou spolehlivě nabídnout (T znamená “twisted pair”); tyto kabely jsou zakončeny konektorem RJ45. Existují další typy kabelů, používané pro rychlosti 1 Gb/s a výše.

source: <primary>address, IP address</primary>
cs_cz: <primary>adresa, IP adresa</primary>

source: <primary>IP address</primary>
cs_cz: <primary>IP adresa</primary>

source: An IP address is a number used to identify a network interface on a computer on a local network or the Internet. In the currently most widespread version of IP (IPv4), this number is encoded in 32 bits, and is usually represented as 4 numbers separated by periods (e.g. <literal>192.168.0.1</literal>), each number being between 0 and 255 (inclusive, which corresponds to 8 bits of data). The next version of the protocol, IPv6, extends this addressing space to 128 bits, and the addresses are generally represented as a series of hexadecimal numbers separated by colons (e.g., 2001:0db8:13bb:0002:0000:0000:0000:0020, or 2001:db8:13bb:2::20 for short).
cs_cz: IP adresa je číslo používané k identifikaci síťového rozhraní na počítači v lokální síti nebo na internetu. V současnosti nejrozšířenější verzi IP (IPv4), je toto číslo kódováno do 32 bitů a je obyčejně prezentováno jako 4 čísla oddělené tečkami (např. <literal>192.168.0.1</literal>), kde je každé číslo mezi 0 a 255 (včetně, což odpovídá osmi bitům dat). Další verze protokolu, IPv6, rozšiřuje tento adresový prostor na 128 bitů a adresy jsou obyčejně reprezentovány jako čísla šestnáctkové soustavy oddělená dvojtečkou (např. 2001:0db8:13bb:0002:0000:0000:0000:0020 nebo zkráceně 2001:db8:13bb:2::20).

source: <primary>mask</primary><secondary>subnet mask</secondary>
cs_cz: <primary>maska</primary><secondary>subnet maska</secondary>

source: <primary>network</primary><secondary>address</secondary>
cs_cz: <primary>síť</primary><secondary>adresa</secondary>

source: A subnet mask (netmask) defines in its binary code which portion of an IP address corresponds to the network, the remainder specifying the machine. In the example of configuring a static IPv4 address given here, the subnet mask, <literal>255.255.255.0</literal> (24 “1”s followed by 8 “0”s in binary representation) indicates that the first 24 bits of the IP address correspond to the network address, and the other 8 are specific to the machine. In IPv6, for readability, only the number of “1”s is expressed; the netmask for an IPv6 network could, thus, be <literal>64</literal>.
cs_cz: Maska subnetu (natmask) definuje ve svém binárním kódu, která část IP adresy odpovídá síti, zbytek určuje zařízení. V příkladu nadefinování statické IP adresy, který zde uvádíme, maska subnetu <literal>255.255.255.0</literal> (24 “1” jedniček doplněných o 8 “0” nul ve dvojkové soustavě) značí, že prvních 24 bitů IP adresy odpovídá síťové adrese a dalších 8 určuje zařízení. U IPv6, je kvůli čitelnosti, pouze vyjádřen pouze počet “1” jedniček; maska sítě pro IPv6 síť tak může být <literal>64</literal>.

source: The network address is an IP address in which the part describing the machine's number is 0. The range of IPv4 addresses in a complete network is often indicated by the syntax, <emphasis>a.b.c.d/e</emphasis>, in which <emphasis>a.b.c.d</emphasis> is the network address and <emphasis>e</emphasis> is the number of bits affected to the network part in an IP address. The example network would thus be written: <literal>192.168.0.0/24</literal>. The syntax is similar in IPv6: <literal>2001:db8:13bb:2::/64</literal>.
cs_cz: Adresa sítě je IP adresa, ve které je část popisující číslo počítače, 0. Rozsah IPv4 adresy v kompletní síti je často indikován syntaxí, <emphasis>a.b.c.d/e</emphasis>, kde <emphasis>a.b.c.d</emphasis> je adresa sítě a <emphasis>e</emphasis> je počet bitů ovlivňovaných síťovou částí IP adresy. Ukázková síť by tak byla napsaná: <literal>192.168.0.0/24</literal>. Syntax v IPv6 je podobný: <literal>2001:db8:13bb:2::/64</literal>.

source: <primary>router</primary>
cs_cz: <primary>směrovač</primary>

source: <primary>bridge</primary>
cs_cz: <primary>most</primary>

source: A router is a machine that connects several networks to each other. All traffic coming through a router is guided to the correct network. To do this, the router analyzes incoming packets and redirects them according to the IP address of their destination. The router is often known as a gateway; in this configuration, it works as a machine that helps reach out beyond a local network (towards an extended network, such as the Internet).
cs_cz: Směrovač je zařízaná, které dohromady spojuje různé sítě. Veškerý provoz, který prochází směrovačem je nasměrována do správné sítě. K tomu, aby se mu to povedlo, směrovač analyzuje přicházející balíky a přesměrovává je podle IP adresy jejich míst určení. Směrovač (router) je často známý jako brána (gateway); v tomto uspořádání funguje jako zařízení, které pomáhá dosáhnout za místní síť (vstříc širší síti, jako je internet).

source: The special broadcast address connects all the stations in a network. Almost never “routed”, it only functions on the network in question. Specifically, it means that a data packet addressed to the broadcast never passes through the router.
cs_cz: Zvláštní adresa broadcastu spojuje všechny stanice v síti. Téměř nikdy “směrována”, pouze funguje v dané síti. Speciálně to znamená, že datové balíky adresované broadcastu nikdy neprocházejí směrovačem.

source: This chapter focuses on IPv4 addresses, since they are currently the most commonly used. The details of the IPv6 protocol are approached in <xref linkend="sect.ipv6" />, but the concepts remain the same.
cs_cz: Tato kapitola se zaměřuje na adresy IPv4, protože jsou v současnosti nejčastěji používané. Detaily o IPv6 protokolu jsou přiblíženy na <xref linkend="sect.ipv6" />, ale princip zůstává stejný.

source: Since the network is automatically configured during the initial installation, the <filename>/etc/network/interfaces</filename> file already contains a valid configuration. A line starting with <literal>auto</literal> gives a list of interfaces to be automatically configured on boot by <emphasis role="pkg">ifupdown</emphasis> and its <filename>/etc/init.d/networking</filename> init script. This will often be <literal>eth0</literal>, which refers to the first Ethernet card.
cs_cz: Protože síť je automaticky nastavena během úvodní instalace, soubor <filename>/etc/network/interfaces</filename> již obsahuje platné nastavení. Řádek začínající slovem <literal>auto</literal> poskytuje seznam rozhraní, určených pro automatické nastavení při bootování prostřednictvím <emphasis role="pkg">ifupdown</emphasis> a jeho inicializačního skriptu <filename>/etc/init.d/networking</filename>. Tím většinou bývá <literal>eth0</literal>, který odkazuje na první ethernetovou kartu.

source: <primary>network</primary><secondary>configuration</secondary>
cs_cz: <primary>síť</primary><secondary>nastavení</secondary>

source: <primary>configuration</primary><secondary>of the network</secondary>
cs_cz: <primary>nastavení</primary><secondary>sítě</secondary>

source: <primary>interface</primary><secondary>network interface</secondary>
cs_cz: <primary>rozhraní</primary><secondary>síťové rozhraní</secondary>

source: <emphasis>ALTERNATIVE</emphasis> NetworkManager
cs_cz: <emphasis>ALTERNATIVA</emphasis> NetworkManager

source: If Network Manager is particularly recommended in roaming setups (see <xref linkend="sect.roaming-network-config" />), it is also perfectly usable as the default network management tool. You can create “System connections” that are used as soon as the computer boots either manually with a <filename>.ini</filename>-like file in <filename>/etc/NetworkManager/system-connections/</filename> or through a graphical tool (<command>nm-connection-editor</command>). Just remember to deactivate all entries in <filename>/etc/network/interfaces</filename> if you want Network Manager to handle them. <ulink type="block" url="https://wiki.gnome.org/Projects/NetworkManager/SystemSettings/jessie" /> <ulink type="block" url="https://developer.gnome.org/NetworkManager/0.9/ref-settings.html" />
cs_cz: Jakkoli je Network Manager obzvlášť doporučovaný při roamingovém nastavení (viz. <xref linkend="sect.roaming-network-config" />), je také dokonale použitelný jako výchozí nástroj pro síťový management. Můžete vytvořit “systémová spojení”, která se použijí, jakmile je počítač bootován buď manuálně pomocí souboru jako je <filename>.ini</filename> v <filename>/etc/NetworkManager/system-connections/</filename> nebo skrze grafický nástroj (<command>nm-connection-editor</command>). Jen nezapomeňte deaktivovat všechna zadání ve <filename>/etc/network/interfaces</filename>, pokud chcete po Network Manageru, aby se o ně postaral. <ulink type="block" url="https://wiki.gnome.org/Projects/NetworkManager/SystemSettings/jessie" /> <ulink type="block" url="https://developer.gnome.org/NetworkManager/0.9/ref-settings.html" />

source: Ethernet Interface
cs_cz: Ethernetové rozhraní

source: If the computer has an Ethernet card, the IP network that is associated with it must be configured by choosing from one of two methods. The simplest method is dynamic configuration with DHCP, and it requires a DHCP server on the local network. It may indicate a desired hostname, corresponding to the <literal>hostname</literal> setting in the example below. The DHCP server then sends configuration settings for the appropriate network.
cs_cz: Pokud počítač má Ethernetovou kartu, IP síť, která je s ní spojená, musí být nastavena zvolením jedné ze dvou metod. Nejjednodušší metoda je dynamické nastavení pomocí DHCP, které vyžaduje DHCP server v místní síti. Může indikovat požadované hostitelovo jméno, odpovídající <literal>hostname</literal> nastavení v níže uvedeném příkladu. DHCP server poté pošle konfigurační nastavení pro správnou síť.

source: DHCP configuration
cs_cz: Nastavení DHCP

source: A “static” configuration must indicate network settings in a fixed manner. This includes at least the IP address and subnet mask; network and broadcast addresses are also sometimes listed. A router connecting to the exterior will be specified as a gateway.
cs_cz: “statické” nastavení musí ukazovat nastavení sítě napevno. Toto zahrnuje minimálně IP adresu a masku podsítě; uvedeny jsou také někdy adresy sítě a broadcastu. Směrovač napojující se na vnějšek bude určen jako brána.

source: Static configuration
cs_cz: Statické nastavení

source: <emphasis>NOTE</emphasis> Multiple addresses
cs_cz: <emphasis>POZNÁMKA</emphasis> Několikanásobná adresa

source: It is possible not only to associate several interfaces to a single, physical network card, but also several IP addresses to a single interface. Remember also that an IP address may correspond to any number of names via DNS, and that a name may also correspond to any number of numerical IP addresses.
cs_cz: Není možné pouze spojovat různá rozhraní s jednou, fyzickou síťovou kartou, ale je také možné spojovat různé IP adresy s jedním rozhraním. Pamatujte si také, že IP adresa může odpovídat jakémukoli množství jmen prostřednictvím DNS a toto jméno může také odpovídat jakémukoli množství číselných IP adres.

source: As you can guess, the configurations can be rather complex, but these options are only used in very special cases. The examples cited here are typical of the usual configurations.
cs_cz: Jak asi hádáte, nastavení mohou být dosti složitá, ale těchto případů je použito pouze ve speciálních případech. Příklady zde citované jsou typické pro obvyklá nastavení.

source: Connecting with PPP through a PSTN Modem
cs_cz: Spojení s PPP prostřednictvím PSTN modemu

source: <primary>point to point</primary>
cs_cz: <primary>bod k bodu</primary>

source: <primary>connection</primary><secondary>by PSTN modem</secondary>
cs_cz: <primary>spojení</primary><secondary>PSTN modemem</secondary>

source: A point to point (PPP) connection establishes an intermittent connection; this is the most common solution for connections made with a telephone modem (“PSTN modem”, since the connection goes over the public switched telephone network).
cs_cz: Spojení bodu k bodu (PPP) zřídí nesouvislé spojení; toto je nejběžnější řešení pro spojení s telefonním modemem (“PSTN modemem”, protože spojení prochází veřejnou spínací telefonní sítí).

source: A connection by telephone modem requires an account with an access provider, including a telephone number, username, password, and, sometimes the authentication protocol to be used. Such a connection is configured using the <command>pppconfig</command> tool in the Debian package of the same name. By default, it sets up a connection named <literal>provider</literal> (as in Internet service provider). When in doubt about the authentication protocol, choose <emphasis>PAP</emphasis>: it is offered by the majority of Internet service providers.
cs_cz: Pro spojení telefonním modemem je potřeba účet s poskytovtelem přístupu, včetně telefonního čisla, uživatelského jména, hesla a někdy i autentifikačního protokolu, co má být použitý. Podobné připojení je nastaveno pomocí nástroje <command>pppconfig</command> z balíčku Debianu toho stejného jména. Implicitně, nastaví připojení jménem <literal>provider</literal> (jako je v Internet service provider). Pokud není jasno o autentifikačním protokolu, vyberte <emphasis>PAP</emphasis>: to je nabízeno většinou poskytovatelů internetových služeb).

source: After configuration, it is possible to connect using the <command>pon</command> command (giving it the name of the connection as a parameter, when the default value of <literal>provider</literal> is not appropriate). The link is disconnected with the <command>poff</command> command. These two commands can be executed by the root user, or by any other user, provided they are in the <literal>dip</literal> group.
cs_cz: Po nastavení, je potom možné připojení použitím příkazu <command>pon</command> (za uvedení jména připojení jako jeho parametru, pokud je výchozí hodnota <literal>provider</literal> nevyhovující). Spojení je přerušeno příkazem <command>poff</command>. Tyto dva příkazy mohou být spuštěny kořenovým uživatelem nebo některým jiným uživatelem, za předpokladu, že jsou ve skupině <literal>dip</literal>.

source: Connecting through an ADSL Modem
cs_cz: Připojení přes ADSL modem

source: <primary>connection</primary><secondary>by ADSL modem</secondary>
cs_cz: <primary>připojení</primary><secondary>ADSL modemem</secondary>

source: The generic term “ADSL modem” covers a multitude of devices with very different functions. The modems that are simplest to use with Linux are those that have an Ethernet interface (and not only a USB interface). These tend to be popular; most ADSL Internet service providers lend (or lease) a “box” with Ethernet interfaces. Depending on the type of modem, the configuration required can vary widely.
cs_cz: Všeobedný název “ADSL modem” zahrnuje spoustu zařízení s velice rozdílnými funkcemi. Modemy, které jsou pro pužití s Linuxem nejjednodušší, jsou ty, které mají ethernetové rozhraní (a ne pouze USB rozhraní). Tyto se stávají populárními; nejvíce poskytovatelů internetové služby ADSL půjčuje (nebo používá leasing pro) “krabičku” s ethernetovými rozhraními. V závislosti na typu modemu se může požadované nastavení hodně odlišovat.

source: Modems Supporting PPPOE
cs_cz: Modemy podporující PPPOE

source: Some Ethernet modems work with the PPPOE protocol (Point to Point Protocol over Ethernet). The <command>pppoeconf</command> tool (from the package with the same name) will configure the connection. To do so, it modifies the <filename>/etc/ppp/peers/dsl-provider</filename> file with the settings provided and records the login information in the <filename>/etc/ppp/pap-secrets</filename> and <filename>/etc/ppp/chap-secrets</filename> files. It is recommended to accept all modifications that it proposes.
cs_cz: Některé ethernetové modemy pracují s protokolem PPPOE (Point to Point protocol over Ethernet). Nástroj <command>pppoeconf</command> (z balíčku se stejným jménem) nastaví připojení. K tomu, aby tak učinil, zmodifikuje soubor <filename>/etc/ppp/peers/dsl-provider</filename> na stanovená nastavení a zaznamenává přihlašovací informace do souborů <filename>/etc/ppp/pap-secrets</filename> a <filename>/etc/ppp/chap-secrets</filename>. Doporučuje se akceptovat všechny změny, které navrhuje.

source: Once this configuration is complete, you can open the ADSL connection with the command, <command>pon dsl-provider</command> and disconnect with <command>poff dsl-provider</command>.
cs_cz: Jakmile je toto nastavení kompletní, můžete otevřít ADSL připojení příkazem <command>pon dsl-provider</command> a zavřít pomocí <command>poff dsl-provider</command>.

source: <emphasis>TIP</emphasis> Starting <command>ppp</command> at boot
cs_cz: <emphasis>TIP</emphasis> Nastartovámí <command>ppp</command> pří bootování

source: PPP connections over ADSL are, by definition, intermittent. Since they are usually not billed according to time, there are few downsides to the temptation of keeping them always open. The standard means to do so is to use the init system.
cs_cz: Připojení PPP jsou, už podle svého naturelu, nesouvislá. Protože nejsou obyčejně účtovaná podle času, je málo věcí, které by odradily od pokušení je stále udržet otevřená. Standardním prostředkem pro to to udělat je použití init systmému.

source: The default init system on <emphasis role="distribution">Jessie</emphasis> is <command>systemd</command>. Adding an automatically restarting task for the ADSL connection is a simple matter of creating a “unit file” such as <filename>/etc/systemd/system/adsl-connection.service</filename>, with contents such as the following:
cs_cz: Výchozí init systném na <emphasis role="distribution">Jessie</emphasis> je <command>systemd</command>. Přidáním automaticky znovuspouštěnéhé úlohy pro přípojení ADSL je jednoduchá záležitost spočívající ve vytvoření souboru “unit file” jako <filename>/etc/systemd/system/adsl-connection.service</filename> s obsahem jako je tento:

source: Once this unit file has been defined, it needs to be enabled with <command>systemctl enable adsl-connection</command>. Then the loop can be started manually with <command>systemctl start adsl-connection</command>; it will also be started automatically on boot.
cs_cz: Jakmile je tento jednotkový soubor nadefinován, musí být uschopněn pomocí <command>systemctl enable adsl-connection</command>. Poté může být smyčka odstartována mauálně pomocí <command>systemctl start adsl-connection</command>; to bude započato také automaticky při bootování.

source: On systems not using <command>systemd</command> (including <emphasis role="distribution">Wheezy</emphasis> and earlier versions of Debian), the standard SystemV init works differently. On such systems, all that is needed is to add a line such as the following at the end of the <filename>/etc/inittab</filename> file; then, any time the connection is disconnected, <command>init</command> will reconnect it.
cs_cz: Na systémech nepoužívajících <command>systemd</command> (včetně <emphasis role="distribution">Wheezy</emphasis> a dřívějších verzích Debianu), standardní init SystemV pracuje rozdílně. Na takových systmémech, všechno, co je potřeba je přidání řádku jako je následující na konec souboru <filename>/etc/inittab</filename>; potom, kdykoli je připojení odpojeno, <command>init</command> je obnoví.
