Repository: jarabt/Hbook
Catalog: 08_basic-configuration.po
Languages: cs_cz

source: For ADSL connections that auto-disconnect on a daily basis, this method reduces the duration of the interruption.
cs_cz: Při připojení ADSL, kde je automatické odpojování na denním pořádku, tato metoda redukuje trvání přerušení.

source: Modems Supporting PPTP
cs_cz: Modemy podporující PPTP

source: The PPTP (Point-to-Point Tunneling Protocol) protocol was created by Microsoft. Deployed at the beginning of ADSL, it was quickly replaced by PPPOE. If this protocol is forced on you, see <xref linkend="sect.pptp" />.
cs_cz: Protokol PPTP (Point-to-Point Tunneling Protocol) byl vytvořen firmou Microsoft. Tento protokol byl nasazený v počátcích ADSL a byl rychle nahrazen protokolem PPPOE. Pokud jste k němu nuceni, nahlédněte zde <xref linkend="sect.pptp" />.

source: Modems Supporting DHCP
cs_cz: Modemy podporující DHCP

source: When a modem is connected to the computer by an Ethernet cable (crossover cable) you typically configure a network connection by DHCP on the computer; the modem automatically acts as a gateway by default and takes care of routing (meaning that it manages the network traffic between the computer and the Internet).
cs_cz: Pokud je modem připojený k počítači ethernetovým kabelem (kříženým kabelem), klasicky nastavíte síťové spojení pomocí DHCP na počítači; modem automaticky (je to tak přednastaveno) hraje roli brány a stará se o směrování (což znamená, že řídí síťový provoz mezi počítačem a internetem).

source: <emphasis>BACK TO BASICS</emphasis> Crossover cable for a direct Ethernet connection
cs_cz: <emphasis>ZPĚT K ZÁKLADŮM</emphasis> Křížený kabel pro přímé ethernetové připojení

source: <primary>crossover cable</primary>
cs_cz: <primary>křížený kabel</primary>

source: Computer network cards expect to receive data on specific wires in the cable, and send their data on others. When you connect a computer to a local network, you usually connect a cable (straight or crossover) between the network card and a repeater or switch. However, if you want to connect two computers directly (without an intermediary switch or repeater), you must route the signal sent by one card to the receiving side of the other card, and vice-versa. This is the purpose of a crossover cable, and the reason it is used.
cs_cz: Karty počítačové sítě očekávají přijímání dat po určitých drátech v kabelu a posílání svých dat po jiných. Jakmile připojíte počítač k místní síti, obyčejně propojíte kabel (přímý nebo křížený) mezi síťovou kartou a opakovačem nebo přepínačem. Kažkopádně, pokud chcete připojit dva počítače přímo (bez zprostředkovatelského přepínače nebo opakovače), musíte směrovat signál odeslaný jednou kartou k přijímací straně druhé karty a naopak. Toto je případ kříženého kabelu a důvod, přoč se používá.

source: Note that this distinction has become almost irrelevant over time, as modern network cards are able do detect the type of cable present and adapt accordingly, so it won't be unusual that both kinds of cable will work in a given location.
cs_cz: Za poznámku stojí, že tato odlišnost se stala postupem času nepodstatnou, protože moderní síťové karty jsou schopny rozpoznat typ přítomného kabelu a podle toho se přizpůsobit, takže nebude nic neobvyklého, že oba druhy kabelu budou fungovat v daném umístění.

source: Most “ADSL routers” on the market can be used like this, as do most of the ADSL modems provided by Internet services providers.
cs_cz: Většina “ADSL směrovačů” na trhu může být tímto způsobem použita, stejně jako ADSL modemy poskytované poskytovateli internetových služeb.

source: Automatic Network Configuration for Roaming Users
cs_cz: Automatické nastavení sítě pro roamingové (toulající se) uživatele

source: <primary>network</primary><secondary>roaming configuration</secondary>
cs_cz: <primary>síť</primary><secondary>roamingové nastavení</secondary>

source: Many Falcot engineers have a laptop computer that, for professional purposes, they also use at home. The network configuration to use differs according to location. At home, it may be a wifi network (protected by a WPA key), while the workplace uses a wired network for greater security and more bandwidth.
cs_cz: Mnoho techniků Falcotu má notebooky, které, pro služební účely, používají také doma. Nastavení sítě pro použití se liší podle umístění. Doma to může být wifi síť (chráněná WPA klíčem), zatímco pracoviště používá kabelovou síť kvůli větší bezpečnosti a šířce pásma.

source: To avoid having to manually connect or disconnect the corresponding network interfaces, administrators installed the <emphasis role="pkg">network-manager</emphasis> package on these roaming machines. This software enables a user to easily switch from one network to another using a small icon displayed in the notification area of their graphical desktop. Clicking on this icon displays a list of available networks (both wired and wireless), so they can simply choose the network they wish to use. The program saves the configuration for the networks to which the user has already connected, and automatically switches to the best available network when the current connection drops.
cs_cz: K tomu, aby se předešlo nutnosti manuálně připojovat nebo odpojovat odpovídající síťová rozhraní, administrátoři nainstalovali na tato roamingová zařízení balíček <emphasis role="pkg">network-manager</emphasis>. Tento software umožňuje snadno přepínat z jedné sítě do druhé použitím malé ikony zobrazené v oznamovací oblasti grafické plochy. Kliknutím na tuto ikonu se zobrazí seznam dostupných sítí (obou, pevných i bezdrávových), takže je možné si jednoduše vyberou síť, kterou chtějí používat. Program ukládá nastavení sítí, ke kterým se již uživatel připojil a automaticky přepíná na nejlepší dostupnou síť, pokud současné připojení spadne.

source: In order to do this, the program is structured in two parts: a daemon running as root handles activation and configuration of network interfaces and a user interface controls this daemon. PolicyKit handles the required authorizations to control this program and Debian configured PolicyKit in such a way so that members of the netdev group can add or change Network Manager connections.
cs_cz: Aby to udělal, je program členěný na dvě části: démon spuštěný jako kořenový má na starosti aktivaci a nastavení síťového rozhraní a uživatelské rozhraní tohoto démona ovládá. Policykit obstarává požadované autorizace pro řízení tohoto programu, Debian na toto nastavil PolicyKit, takže prvky skupiny netdev mohou přidávat nebo měnit připojení síťového manažera (Network Managera).

source: Network Manager knows how to handle various types of connections (DHCP, manual configuration, local network), but only if the configuration is set with the program itself. This is why it will systematically ignore all network interfaces in <filename>/etc/network/interfaces</filename> for which it is not suited. Since Network Manager doesn't give details when no network connections are shown, the easy way is to delete from <filename>/etc/network/interfaces</filename> any configuration for all interfaces that must be managed by Network Manager.
cs_cz: Network Manager (síťový manažer) ví, jak obstarávat různé typy připojení (DHCP, manuální nastavení, místní síť), ale pouze na předpokladu, že konfigurace je nastavena programem samotným. Toto je důvod, proč bude systematicky ignorovat všechna síťová rozhraní v <filename>/etc/network/interfaces</filename> pro která není uzpůsobený. Protože síťový manažer neposkytuje detaily, pokud nejsou žádná síťová připojení ukázána, snadným způsobem je vymazání jakýchkoli nastavení pro všechna rozhraní, která se musí řídit síťovým manažerem, z <filename>/etc/network/interfaces</filename>.

source: Note that this program is installed by default when the “Desktop Environment” task is chosen during initial installation.
cs_cz: Za zmínku stojí, že tento program je defaultně nainstalován, pokud je úloha “desktopové prostředí” vybrána během prvotní instalace.

source: <emphasis>ALTERNATIVE</emphasis> Configuration by “network profile”
cs_cz: <emphasis>ALTERNATIVA</emphasis> Nastavení pomocí “síťového profilu”

source: More advanced users may want to try the <emphasis role="pkg">guessnet</emphasis> package for automatic network configuration. A group of test scripts determine which network profile should be activated and configure it on the fly.
cs_cz: Pokročilí uživatelé mohou chtít vyzkoušet balíček <emphasis role="pkg">guessnet</emphasis> pro automatické síťové nastavení. Skupina testovacích skriptů určuje, který síťový profil by měl být aktivován a nastaví jej za běhu.

source: Users who prefer to manually select a network profile will prefer the <emphasis role="pkg">netenv</emphasis> program, found in the package of the same name.
cs_cz: Uživatelé, kteří dávají přednost manuálnímu výběru síťového profilu, dají přednost programu <emphasis role="pkg">netenv</emphasis>, který se nalézá v balíčku stejného jména.

source: Setting the Hostname and Configuring the Name Service
cs_cz: Nastavení jména hostitele a konfigurace jmenné služby

source: <primary>name</primary><secondary>attribution and resolution</secondary>
cs_cz: <primary>jméno</primary><secondary>připisování a rozlišení</secondary>

source: <primary>assignment of names</primary>
cs_cz: <primary>přiřazení jmen</primary>

source: The purpose of assigning names to IP numbers is to make them easier for people to remember. In reality, an IP address identifies a network interface associated with a device such as a network card. Since each machine can have several network cards, and several interfaces on each card, one single computer can have several names in the domain name system.
cs_cz: Účelem připisování jmen číslům IP je zjednodušení jejich zapamatování pro člověka. Ve skutečnosti, IP adresa identifikuje síťové rozhraní vztažené k zařízení jako je síťová karta. Protože každé zařízení může mít několik síťových karet a několik rozhraní na každé kartě, jeden jediný počítač může mít měkolik jmen v doménovém jménu systému.

source: Each machine is, however, identified by a main (or “canonical”) name, stored in the <filename>/etc/hostname</filename> file and communicated to the Linux kernel by initialization scripts through the <command>hostname</command> command. The current value is available in a virtual filesystem, and you can get it with the <command>cat /proc/sys/kernel/hostname</command> command.
cs_cz: Nicméně, každé zařízení je identidikované pomocí hlavního (nebo “kanonického”) jména, uložené v souboru <filename>/etc/hostname</filename> a sdělené Linuxovému jádru inicializačním skriptem prostřednictvím příkazu <command>hostname</command>. Současná hodnota je dostupná ve virtuálním systému souborů a můžete ji obdržet pomocí příkazu <command>cat /proc/sys/kernel/hostname</command>.

source: <emphasis>BACK TO BASICS</emphasis> <filename>/proc/</filename> and <filename>/sys/</filename>, virtual filesystems
cs_cz: <emphasis>ZPĚT K ZÁKLADŮM</emphasis> <filename>/proc/</filename> a <filename>/sys/</filename>, virtuální systém souborů

source: The <filename>/proc/</filename> and <filename>/sys/</filename> file trees are generated by “virtual” filesystems. This is a practical means of recovering information from the kernel (by listing virtual files) and communicating them to it (by writing to virtual files).
cs_cz: Stromy souborů <filename>/proc/</filename> a <filename>/sys/</filename> jsou generované “virtuálním” souborovým systémem. Toto je praktický prostředek pro obnovování informací z jádra (vypisováním virtuálních souborů) a jejich sdělování jemu (pomocí zapisování do virtuálních souborů).

source: <filename>/sys/</filename> in particular is designed to provide access to internal kernel objects, especially those representing the various devices in the system. The kernel can, thus, share various pieces of information: the status of each device (for example, if it is in energy saving mode), whether it is a removable device, etc. Note that <filename>/sys/</filename> has only existed since kernel version 2.6.
cs_cz: <filename>/sys/</filename> je v podstavě navržen pro poskytování přístupu k interním objektům jádra, zvláště těm, která reprezentují různá zařízení v systému. Jádro tak tedy může sdílet různé kusy informací: stav každého zařízení (například, zda je v módu úspory energie), zda je to odnímatelné zařízení apod. Za poznámku jistě stojí, že <filename>/sys/</filename> existuje až od jádra verze 2.6.

source: Surprisingly, the domain name is not managed in the same way, but comes from the complete name of the machine, acquired through name resolution. You can change it in the <filename>/etc/hosts</filename> file; simply write a complete name for the machine there at the beginning of the list of names associated with the address of the machine, as in the following example:
cs_cz: Překvapivě, doménové jméno není řízeno stejným způsobem, ale pochází z celkového jména zařízení, obdrženého při rozeznávání jména. Můžete jej změnit v souboru <filename>/etc/hosts</filename>; jednoduše sem, na začátek seznamu jmen vztažených k adrese zařízení, napište úplné jméno zařízení, stejně, jako v následujícím příkldu:

source: <primary>domain</primary><secondary>name</secondary>
cs_cz: <primary>doména</primary><secondary>jméno</secondary>

source: <primary>name</primary><secondary>domain</secondary>
cs_cz: <primary>jméno</primary><secondary>doména</secondary>

source: Name Resolution
cs_cz: Rozlišení jména

source: <primary>resolution</primary><secondary>name</secondary>
cs_cz: <primary>rozlišení</primary><secondary>jméno</secondary>

source: <primary>name</primary><secondary>resolution</secondary>
cs_cz: <primary>jméno</primary><secondary>rozlišení</secondary>

source: The mechanism for name resolution in Linux is modular and can use various sources of information declared in the <filename>/etc/nsswitch.conf</filename> file. The entry that involves host name resolution is <literal>hosts</literal>. By default, it contains <literal>files dns</literal>, which means that the system consults the <filename>/etc/hosts</filename> file first, then DNS servers. NIS/NIS+ or LDAP servers are other possible sources.
cs_cz: Mechanismus pro rozlišování jména je v Linuxu modulární a může použít různé zdroje informací deklarovaných v souboru <filename>/etc/nsswitch.conf</filename>. Vstup, který zahrnuje rozlišení hostitelského jména je <literal>hosts</literal>. Ve výchozím nastavení obsahuje <literal>files dns</literal>, což znamená, že nejdříve systém nahlédne do souboru <filename>/etc/hosts</filename> a potom do DNS serverů. NIS/NIS+ nebo LDAP servery jsou dalšími možnými zdroji.

source: <emphasis>NOTE</emphasis> NSS and DNS
cs_cz: <emphasis>POZNÁMKA</emphasis> NSS a DNS

source: Be aware that the commands specifically intended to query DNS (especially <command>host</command>) do not use the standard name resolution mechanism (NSS). As a consequence, they do not take into consideration <filename>/etc/nsswitch.conf</filename>, and thus, not <filename>/etc/hosts</filename> either.
cs_cz: Uvědomte si, že tyto příkazy, které mají konkrétně v úmyslu dotazovat DNS (konkrétně <command>host</command>) nepoužívjí standardní mechanismus na rozlišení jména (NSS). Jako důsledek toho, neberou v úvahu ani <filename>/etc/nsswitch.conf</filename> ani <filename>/etc/hosts</filename>.

source: Configuring DNS Servers
cs_cz: Nastavení DNS Serveru

source: DNS (Domain Name Service) is a distributed and hierarchical service mapping names to IP addresses, and vice-versa. Specifically, it can turn a human-friendly name such as <literal>www.eyrolles.com</literal> into the actual IP address, <literal>213.244.11.247</literal>.
cs_cz: DNS (Domain Name Service) je distribuovaná a hierarchická služba mapující jména k IP adresám a naopak. Přesněji, může přeměnit člověku přátelské jméno jako je <literal>www.eyrolles.com</literal> na opravdovou IP adresu, <literal>213.244.11.247</literal>.

source: To access DNS information, a DNS server must be available to relay requests. Falcot Corp has its own, but an individual user is more likely to use the DNS servers provided by their ISP.
cs_cz: Pro přístup k DNS informacím, DNS server musí být dostupný a předávat požadavky. Falcot Corp má svůj vlastní, ale samostatný uživatel s větší pravděpodobností použije DNS server svého ISP.

source: The DNS servers to be used are indicated in the <filename>/etc/resolv.conf</filename>, one per line, with the <literal>nameserver</literal> keyword preceding an IP address, as in the following example:
cs_cz: DNS servery k použití jsou označeny v <filename>/etc/resolv.conf</filename>, každý na jednom řádku, s klíčovým slovem <literal>nameserver</literal> předcházejícím IP adresu, stejně jako v tomto příkladu:

source: Note that the <filename>/etc/resolv.conf</filename> file may be handled automatically (and overwritten) when the network is managed by NetworkManager or configured via DHCP.
cs_cz: Za poznámku stojí, že se souborem <filename>/etc/resolv.conf</filename> může být manipulváno automaticky (a může být i přepisován), pokud je síť řízena NetworkManagerem nebo nastavována přes DHCP.

source: The <filename>/etc/hosts</filename> file
cs_cz: Soubor <filename>/etc/hosts</filename>

source: If there is no name server on the local network, it is still possible to establish a small table mapping IP addresses and machine hostnames in the <filename>/etc/hosts</filename> file, usually reserved for local network stations. The syntax of this file is very simple: each line indicates a specific IP address followed by the list of any associated names (the first being “completely qualified”, meaning it includes the domain name).
cs_cz: Pokud v lokální síti neexistuje žádný jmenný server, je stále možné zřídit malou tabulku mapující IP adresy a hostitelská jména zařízení v souboru <filename>/etc/hosts</filename>, obyčejně rezervovaným pro stanice místní sítě. Syntax tohoto souboru je velmi jednoduchý: každý řádek ukazuje specifickou IP adresu následovanou seznamem jakýchkoli vztažených jmen (první bývá “úplně klasifikovaná”, což znamená včetně doménového jména).

source: This file is available even during network outages or when DNS servers are unreachable, but will only really be useful when duplicated on all the machines on the network. The slightest alteration in correspondence will require the file to be updated everywhere. This is why <filename>/etc/hosts</filename> generally only contains the most important entries.
cs_cz: Tento soubor je k dispozici jak během výpadků proudu, tak v případě, že jsou DNS servery nedostupné, ale bude skutečně užitečný, pokud bude nakopírován na všech zařízeních v síti. Sebemenší úprava v korespondenci bude vyžadovat, aby byl soubor všude aktualizován. Proto <filename>/etc/hosts</filename> obyčejně obsahuje pouze nejdůležitější záznamy.

source: This file will be sufficient for a small network not connected to the Internet, but with 5 machines or more, it is recommended to install a proper DNS server.
cs_cz: Tento subor bude vhodný pro malou síť nepřipojenou k internetu, ale s 5 zařízeními nebo více se doporučuje nainstalovat náležitý DNS server.5 zařízeními nebo více se doporučuje nainstalovat náležitý DNS server.5 zařízeními nebo více se doporučuje nainstalovat náležitý DNS server.5 zařízeními nebo více se doporučuje nainstalovat náležitý DNS server.5 zařízeními nebo více se doporučuje nainstalovat náležitý DNS server.

source: <emphasis>TIP</emphasis> Bypassing DNS
cs_cz: <emphasis>TIP</emphasis> Obejití DNS

source: Since applications check the <filename>/etc/hosts</filename> file before querying DNS, it is possible to include information in there that is different from what the DNS would return, and therefore to bypass normal DNS-based name resolution.
cs_cz: Protože aplikace kontrolují soubor <filename>/etc/hosts</filename> před dotazováním se na DNS, je možné sem zahrnout informace, které se liší od těch, co by DNS vrátila a tudíž obejít běžné řešení jmen založené na DNS.

source: This allows, in the event of DNS changes not yet propagated, to test access to a website with the intended name even if this name is not properly mapped to the correct IP address yet.
cs_cz: Toto umožňuje, v případě, že se DNS změny ještě nerozšířili, otestovat přístup k internetové stránce ze zamýšleným jménem i když se toto jméno ještě náležitě nenamapovalo ke správné IP adrese.

source: Another possible use is to redirect traffic intended for a specific host to the localhost, thus preventing any communication with the given host. For example, hostnames of servers dedicated to serving ads could be diverted which would bypass these ads resulting in more fluid, less distracting, navigation.
cs_cz: Jiným možným použitím je přesměrování provozu určeného pro specifického hostitele na místního hostitele a tak zamezit komunikaci s daným hostitelem. Například hostitelská jména serverů věnujících se poskytování reklam mohou být odkloněna, což by mělo za následek obejití těchto reklam a tím plynulejší a méně rušivou navigaci.

source: User and Group Databases
cs_cz: Uživatelské a skupinové databáze

source: <primary>user</primary><secondary>database</secondary>
cs_cz: <primary>uživatel</primary><secondary>databáze</secondary>

source: <primary>group</primary><secondary>database</secondary>
cs_cz: <primary>skupina</primary><secondary>databáze</secondary>

source: <primary>database</primary><secondary>of users</secondary>
cs_cz: <primary>database</primary><secondary>uživatelů</secondary>

source: <primary>database</primary><secondary>of groups</secondary>
cs_cz: <primary>databáze</primary><secondary>skupin</secondary>

source: The list of users is usually stored in the <filename>/etc/passwd</filename> file, while the <filename>/etc/shadow</filename> file stores encrypted passwords. Both are text files, in a relatively simple format, which can be read and modified with a text editor. Each user is listed there on a line with several fields separated with a colon (“<literal>:</literal>”).
cs_cz: Seznam uživatelů je obyčejně uložen v souboru <filename>/etc/passwd</filename>, zatímco soubor <filename>/etc/shadow</filename> ukládá zakódovaná hesla. Oba jsou textové soubory v relativně jednoduchém formátu, který může být jak čten, tak modifikován pomocí textového editoru. Každý uživatel je zde vypsán na řádek s několika poli oddělenými dvojtečkami (“<literal>:</literal>”).

source: <emphasis>NOTE</emphasis> Editing system files
cs_cz: <emphasis>POZNÁMKA</emphasis> Editace systémových souborů

source: The system files mentioned in this chapter are all plain text files, and can be edited with a text editor. Considering their importance to core system functionality, it is always a good idea to take extra precautions when editing system files. First, always make a copy or backup of a system file before opening or altering it. Second, on servers or machines where more than one person could potentially access the same file at the same time, take extra steps to guard against file corruption.
cs_cz: Veškeré systémové soubory zmíněné v této kapitole jsou čisté textové soubory a mohou být upravované pomocí textového editoru. S ohledem na jejich důležitost co do klíčové systémové funkcionality, je vždy dobré učinit zvláštní preventivní opatření při editaci systémových souborů. Nejdříve, vždy si udělejte kopii nabo zálohu systémového souboru před jeho otevřením nebo pozměněním. Za druhé, na serverech či zařízeních, kde může mít více než jedna osoba přístup k tomu samému souboru v ten samý čas, učiňte kroky navíc a chraňte soubory proti narušení.
